{"docstore": [{"metadata": {"id": "RAG.pdf:1:0"}, "page_content": "AI VIET NAM – COURSE 2023\nFoundation of Prompt Engineering\nNgày 19 tháng 3 năm 2024\nPhần I: Tổng quan vềRAG\nPhần II: Retrieval Augmented Generation\n(RAG)\nTrong bối cảnh các mô hình ngôn ngữlớn (LLM) phát triển mạnh mẽ, sựxuất hiện của các mô hình\nGPT (OpenAI), LLama (Meta), Gemini (Google) đã thểhiện khảnăng ấn tượng trong việc sinh ngôn\nngữ, thực hiện tác tác vụvới ngôn ngữtựnhiên. Cho dù vậy, các mô hình ngôn ngữlớn vẫn cho thấy\ncòn nhiều điểm yếu như dữliệu thiếu tính cập nhật, thiếu dữliệu chuyên môn cho các lĩnh vực cụthể\nhay sinh ngôn ngữthiếu chính xác (hay được biết đến với thuật ngữ\"hallucination\").", "id": "0"}, {"metadata": {"id": "RAG.pdf:1:1"}, "page_content": "Bên cạnh đó, nhu cầu sửdụng mô hình ngôn ngữđểtương tác với dữliệu riêng, dữliệu doanh\nnghiệp cũng gặp nhiều khó khăn với việc các giải pháp fine-tuning, training LLM bởi chi phí lớn và yêu\ncầu kỹthuật cao.", "id": "1"}, {"metadata": {"id": "RAG.pdf:1:2"}, "page_content": "RAG ra đời cung cấp giải pháp nhanh chóng, tiện lợi cho phép LLM sửdụng thông\ntin bổsung đểgiao tiếp, ...", "id": "2"}, {"metadata": {"id": "RAG.pdf:1:3"}, "page_content": "1\nKhái niệm RAG\nRetrieval Augmented Generation (RAG) lần đầu được giới thiệu bởi nhóm kỹsư thuộc Meta AI là một\nkỹthuật trong lĩnh vực xửlý ngôn ngữtựnhiên (NLP) nhằm nâng cao độchính xác và tin cậy của các\nmô hình tạo văn bản (Generative language models - LLMs).", "id": "3"}, {"metadata": {"id": "RAG.pdf:1:4"}, "page_content": "RAG kết hợp hai thành phần chính: cấu\nphần truy xuất thông tin (Retriever) và mô hình sinh ngôn ngữ(Generator):\n• Truy xuất thông tin (Retrieval): RAG không chỉdựa vào dữliệu đào tạo ban đầu của LLM\nmà còn truy cập một nguồn kiến thức bên ngoài, thường là các văn bản được xác định trước và\ncó độtin cậy cao.", "id": "4"}, {"metadata": {"id": "RAG.pdf:1:5"}, "page_content": "Khi nhận được yêu cầu, RAG sẽphân tích nó và tìm kiếm thông tin liên quan\ntrong nguồn kiến thức bên ngoài.", "id": "5"}, {"metadata": {"id": "RAG.pdf:1:6"}, "page_content": "• Tạo văn bản (Generation): Dựa trên thông tin đã truy xuất, LLM sẽtạo ra văn bản phản hồi\nphù hợp với yêu cầu.", "id": "6"}, {"metadata": {"id": "RAG.pdf:1:7"}, "page_content": "Quá trình này có thểbao gồm tóm tắt, giải thích, trảlời câu hỏi, viết văn\nbản sáng tạo, v.v.", "id": "7"}, {"metadata": {"id": "RAG.pdf:1:8"}, "page_content": "Trong bài báo của Lewis et al.", "id": "8"}, {"metadata": {"id": "RAG.pdf:1:9"}, "page_content": "(2021), khi lần đầu đềcấp đến hệthống RAG, Lewis đã sửdụng một\nmô hình seq2seq huấn luyện trước ...", "id": "9"}, {"metadata": {"id": "RAG.pdf:1:10"}, "page_content": "1\n", "id": "10"}, {"metadata": {"id": "RAG.pdf:2:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 1: Giải pháp RAG cung cấp bởi Lewis (2020).", "id": "11"}, {"metadata": {"id": "RAG.pdf:2:1"}, "page_content": "Giải pháp kết hợp một mô hình truy vấn được huấn\nluyện trước (Query Encoder + Document Index) và một mô hình seq2seq huấn luyện trước (Generator).", "id": "12"}, {"metadata": {"id": "RAG.pdf:2:2"}, "page_content": "Với đầu vào là truy vấn x, Maximum Inner Product Search (MIPS) được sửdụng đểtìm ra top-k tài\nliệu liên quan.", "id": "13"}, {"metadata": {"id": "RAG.pdf:2:3"}, "page_content": "Tài liệu tìm thấy được sửdụng trong phần dựbáo của mô hình seq2seq.", "id": "14"}, {"metadata": {"id": "RAG.pdf:2:4"}, "page_content": "Hình 2: Hệthống RAG cơ bản với các cấu phần: Nguồn thông tin tra cứu (Knowledge Base), Truy vấn\n(Retriever), Mô hình sinh (Generator), Truy vấn đầu vào và Kết quảđầu ra.", "id": "15"}, {"metadata": {"id": "RAG.pdf:2:5"}, "page_content": "Hệthống RAG cho phép tìm kiếm và nhận vềcác tài liệu liên quan đến câu hỏi truy vấn của người\ndùng.", "id": "16"}, {"metadata": {"id": "RAG.pdf:2:6"}, "page_content": "Các tài liệu này được sửdụng như nguồn thông tin kết hợp với câu hỏi truy vấn đểtạo ra câu\ntrảlời cuối cùng thông qua một mô hình sinh ngôn ngữ.", "id": "17"}, {"metadata": {"id": "RAG.pdf:2:7"}, "page_content": "Phương pháp này cho phép RAG thích ứng với\ncác yêu cầu mà nguồn thông tin thay đổi theo thời gian thực, truy cập thông tin mới nhất, tạo ra kết\nquảđáng tin câỵmà không cần phải huấn luyện lại mô hình.", "id": "18"}, {"metadata": {"id": "RAG.pdf:2:8"}, "page_content": "Đây cũng là lý do giúp RAG trởthành\ngiải pháp hữu hiệu giải quyết nhược điểm \"hallucination\" của các mô hình ngôn ngữhuấn luyện trước. 2\nCấu trúc tổng quan\nTương tựnhư các giải pháp LLM khác, hệthống RAG tiếp nhận yêu cầu người dùng (User Query) và\nxửlý đểđưa ra kết quảtrảvề(Output).", "id": "19"}, {"metadata": {"id": "RAG.pdf:2:9"}, "page_content": "Ngoài ra hai cấu phần chính của hệthống RAG là bộtruy\nvấn (Retriever) và mô hình sinh (Generator).", "id": "20"}, {"metadata": {"id": "RAG.pdf:2:10"}, "page_content": "Thông thường, bên cạnh Retriever, một cơ sởdữliệu phi\ncấu trúc (Knowledge Base) cần được được thiết lập và xửlý trước.", "id": "21"}, {"metadata": {"id": "RAG.pdf:2:11"}, "page_content": "2\n", "id": "22"}, {"metadata": {"id": "RAG.pdf:3:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 3: Ví dụchi tiết hoạt động của hệthống RAG.", "id": "23"}, {"metadata": {"id": "RAG.pdf:3:1"}, "page_content": "Nguồn: Gao et al.", "id": "24"}, {"metadata": {"id": "RAG.pdf:3:2"}, "page_content": "(2024)\nCác thành phần trong ví dụcó thểgiải thích như sau:\n• Input: Câu hỏi đầu vào, thường được cung cấp/yêu cầu bởi người dùng nhằm truy vấn và tương\ntác với mô hình ngôn ngữ.", "id": "25"}, {"metadata": {"id": "RAG.pdf:3:3"}, "page_content": "• Indexing: Trong hệthống RAG, đểxây dựng Knowledge Base, các văn bản/tài liệu cần được xử\nlý (indexing) và lưu trữdưới các định dạng dễdàng truy vấn như vector. Các thao tác cần xử\nlý có thểkểđến như phân đoạn (chunking), vector hoá (embedding), lưu trữtrên cơ sởdữliệu\nvector (vector store database).", "id": "26"}, {"metadata": {"id": "RAG.pdf:3:4"}, "page_content": "Trong quá trình truy vấn, câu hỏi người dùng sẽđược embedded\nđểsẵn sàng cho các thuật toán tìm kiếm.", "id": "27"}, {"metadata": {"id": "RAG.pdf:3:5"}, "page_content": "• Retrieval: Quá trình tìm kiếm các đoạn tài liệu (chunks) liên quan đến câu hỏi truy vấn.", "id": "28"}, {"metadata": {"id": "RAG.pdf:3:6"}, "page_content": "Công\ntác tìm kiếm thường được thực hiện thông qua phép tìm kiếm mức độtương đồng (similarity), so\nsánh vector truy vấn và vector đã được xửlý (index) trong cơ sởdữliệu vector.", "id": "29"}, {"metadata": {"id": "RAG.pdf:3:7"}, "page_content": "Các kết quảcó\nsimilarity score cao thểhiện mức độtương quan tốt với câu hỏi truy vấn.", "id": "30"}, {"metadata": {"id": "RAG.pdf:3:8"}, "page_content": "Giá trịtop-k cũng được\nthiết lập tại bước này nhằm thểhiện sốlượng k tài liệu có score cao nhất được lấy ra từbước này.", "id": "31"}, {"metadata": {"id": "RAG.pdf:3:9"}, "page_content": "• Generation: Khái niệm thểhiện cho các mô hình sinh ngôn ngữ, có thểbiết đến như các mô\nhình ngôn ngữlớn (từcác mô hình thương mại như GPT - OpenAI, Gemini - Google, Claude\n- Anthropic cho đến các mô hình mã nguồn mởnhư Llama - MetaAI, BLOOM, BERT, Falcon,\nMixtral, Vicuna, PhoGPT,...).", "id": "32"}, {"metadata": {"id": "RAG.pdf:3:10"}, "page_content": "Trong hệthống RAG, các tài liệu liên quan được đưa vào mô hình\nngôn ngữcùng câu hỏi dưới dạng prompt (ngữcảnh bổsung thông tin).", "id": "33"}, {"metadata": {"id": "RAG.pdf:3:11"}, "page_content": "Kết quảtừmô hình ngôn\nngữđược đưa vềngười dùng như câu trảlời.", "id": "34"}, {"metadata": {"id": "RAG.pdf:3:12"}, "page_content": "3\nPhân loại RAG\nTheo Yunfan Gao et al, một khảo sát tổng hợp chi tiết vềsựphát triển của các hệthống RAG đã được\nthực hiện và ra công bốvào những ngày đầu năm dương lịch 2024 Gao et al.", "id": "35"}, {"metadata": {"id": "RAG.pdf:3:13"}, "page_content": "(2024).", "id": "36"}, {"metadata": {"id": "RAG.pdf:3:14"}, "page_content": "Theo đó, các hệ\n3\n", "id": "37"}, {"metadata": {"id": "RAG.pdf:4:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nthống RAG có thểđược phân loại theo các bước phát triển của mô hình từRAG cơ bản (Naive) đến\nRAG nâng cao (Advanced) và Mô-đun RAG (Modular). Các mô hình có sựcập nhật và giải quyết được\ncác giới hạn của mô hình trước vềcác mặt mức độthểhiện (performance), thời gian và hiệu quả(cost\nand efficiency).", "id": "38"}, {"metadata": {"id": "RAG.pdf:4:1"}, "page_content": "Hình 4: Phân loại hệthống RAG.", "id": "39"}, {"metadata": {"id": "RAG.pdf:4:2"}, "page_content": "Nguồn: Gao et al.", "id": "40"}, {"metadata": {"id": "RAG.pdf:4:3"}, "page_content": "(2024)\n(a) RAG cơ bản bao gồm các bước thực hiện truyền thống từ: xửlý dữliệu nguồn (indexing), truy\nvấn (retrieval) và sinh câu trảlời (generation).", "id": "41"}, {"metadata": {"id": "RAG.pdf:4:4"}, "page_content": "RAG cơ bản tồn tại các giới hạn như chỉlệchính\nxác chưa cao đén từviệc truy vấn thiếu chính xác các phân đoạn tài liệu (chunks) liên quan.", "id": "42"}, {"metadata": {"id": "RAG.pdf:4:5"}, "page_content": "Điều\nnày cũng là nguyên nhân khiến các vấn đềvề\"tựcho mình đúng\" (hallucination) từcác mô hình\nLLM còn tồn tại.", "id": "43"}, {"metadata": {"id": "RAG.pdf:4:6"}, "page_content": "(b) RAG nâng cao cung cấp các giải pháp giải quyết nhược điểm của RAG cơ bản như cải thiện\nchất lượng truy vấn bằng cách thực thi các giải pháp tiền truy vấn, trong truy vấn và sau truy\nvấn.", "id": "44"}, {"metadata": {"id": "RAG.pdf:4:7"}, "page_content": "• Giải pháp tiền truy vấn: bao gồm tối ưu quá trình xửlý dữliệu nguồn như tối ưu cấu\ntrúc tài liệu đã xửlý bằng các phương pháp tách tài liệu (chunking khác nhau: sentence\nsplitter, sentence window, semantic splitter, hierarchical,...), bổsung metadata, tối ưu mô\nhình embedding bằng embedding fine-tuning,...", "id": "45"}, {"metadata": {"id": "RAG.pdf:4:8"}, "page_content": "• Giải pháp truy vấn: Quá trình truy vấn có thểđược cải thiện bằng các giải pháp viết lại\ncâu hỏi truy vấn (Sub-queries), truy vấn mởrộng (sửdụng bộlọc metadata), truy vấn với\ncác phương pháp khác nhau (full-text search, semantic-search, hybrid-search).", "id": "46"}, {"metadata": {"id": "RAG.pdf:4:9"}, "page_content": "• Giải pháp sau truy vấn: Các kết quảsau khi truy vấn với nhiều phương pháp được xếp\nhạng lại nhằm đánh giá lại mức độtương quan trước khi chọn ra top-k tài liệu liên quan\nnhất.", "id": "47"}, {"metadata": {"id": "RAG.pdf:4:10"}, "page_content": "4\n", "id": "48"}, {"metadata": {"id": "RAG.pdf:5:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\n(c) Mô-đun RAG: Một cách hệthống, giải pháp RAG bao gồm nhiều cấu phần, mỗi cấu phần thực\nhiện các chức năng khác nhau. Mô-đun RAG được thiết kếvới các mô đun chức năng nhằm cải\nthiện chất lượng của các cấu phần thuộc hệthống RAG.", "id": "49"}, {"metadata": {"id": "RAG.pdf:5:1"}, "page_content": "Một cách tổng quan, RAG cơ bản là một\ngiải pháp thuộc RAG nâng cao, RAG nâng cao là một trường hợp của Mô-đun RAG với các chức\nnăng cốđịnh.", "id": "50"}, {"metadata": {"id": "RAG.pdf:5:2"}, "page_content": "Các mô đun RAG bao gồm tìm kiếm (Search), bộnhớ(Memory), kết hợp (Fusion),\n(Routing), (Predict), (Task Adaptable Module).", "id": "51"}, {"metadata": {"id": "RAG.pdf:5:3"}, "page_content": "Các mô đun này được sắp xếp đểgiải quyết các\nvấn đềcụthể.", "id": "52"}, {"metadata": {"id": "RAG.pdf:5:4"}, "page_content": "Nhằm tăng tính linh hoạt của hệthống RAG, một sốkỹthuật có thểáp dụng như:\n• Hybrid Search Exploration: Là giải pháp kết hợp hai giải pháp tìm kiếm là tìm kiếm với\ntừkhoá (keyword) và tìm kiếm theo ngữnghĩa (semantic).", "id": "53"}, {"metadata": {"id": "RAG.pdf:5:5"}, "page_content": "Giải pháp này tối ưu được kết\nquảchính xác từviệc tìm theo từkhoá và việc linh hoạt tìm kiếm với các từcùng ngữcảnh.", "id": "54"}, {"metadata": {"id": "RAG.pdf:5:6"}, "page_content": "Kết hợp với giải pháp này thường là các thuật toán xếp hạng (reranker) đểphân hạng lại\ncác kết quảcó được từhai phương pháp tìm kiếm.", "id": "55"}, {"metadata": {"id": "RAG.pdf:5:7"}, "page_content": "• Recursive Retrieval and Query Engine: Giải pháp cung cấp phương pháp phân chia\ntài liệu hiệu quảvới các cấp phân chia.", "id": "56"}, {"metadata": {"id": "RAG.pdf:5:8"}, "page_content": "Cấp nhỏđểphân chia thành các đoạn tài liệu ngắn\nnhằm gia tăng khảnăng tìm kiếm các nội dung tương đồng.", "id": "57"}, {"metadata": {"id": "RAG.pdf:5:9"}, "page_content": "Sau đó, cấp lớn chứa đoạn tài\nliệu dài hơn, bao chùm ngữcảnh tốt hơn (chứa đoạn nhỏ) được trảvềnhư kết quảtìm kiếm.", "id": "58"}, {"metadata": {"id": "RAG.pdf:5:10"}, "page_content": "Giải pháp cho phép tìm kiếm chính xác hơn mà vẫn giữđược ngữcảnh của tài liệu.", "id": "59"}, {"metadata": {"id": "RAG.pdf:5:11"}, "page_content": "• Sub-Queries: Trong bối cảnh thực tế, rất nhiều loại truy vấn được thực hiện.", "id": "60"}, {"metadata": {"id": "RAG.pdf:5:12"}, "page_content": "Nhằm tối ưu\nviệc truy vấn, các giải pháp vềtruy vấn được đềxuất, từviệc đơn giản hoá truy vấn, truy\nvấn nhiều cấp hay xác định chủđích truy vấn.", "id": "61"}, {"metadata": {"id": "RAG.pdf:5:13"}, "page_content": "Các giải pháp này nhằm tăng cường mức độ\nhoàn thiện của đầu vào truy vấn, cũng như nâng cao mức độchính xác của kết quảtruy vấn.", "id": "62"}, {"metadata": {"id": "RAG.pdf:5:14"}, "page_content": "• Hypotherical Document Embeddings: Gao et al.", "id": "63"}, {"metadata": {"id": "RAG.pdf:5:15"}, "page_content": "(2022) đã đưa ra giải pháp mới với\nquan điểm tìm kiếm dựa trên một câu trảlời giảthuyết sẽcho kết quảtốt hơn tìm kiếm\ntrực tiếp với câu hỏi truy vấn.", "id": "64"}, {"metadata": {"id": "RAG.pdf:5:16"}, "page_content": "Giải pháp HyDE sửdụng một LLM đểtạo ra một câu trảlời\ngiảthuyết cho câu hỏi truy vấn.", "id": "65"}, {"metadata": {"id": "RAG.pdf:5:17"}, "page_content": "Sau đó câu trảlời này được sửdụng làm đầu vào cho việc\ntìm kiếm thông tin liên quan.", "id": "66"}, {"metadata": {"id": "RAG.pdf:5:18"}, "page_content": "Kết quảtìm kiếm sẽđược đưa trởlại LLM cùng câu hỏi truy\nvấn đểtạo ra câu trảlời cuối cùng.", "id": "67"}, {"metadata": {"id": "RAG.pdf:5:19"}, "page_content": "Trên thực tế, giải pháp này không phải lúc nào cũng\nhiệu quảdo phụthuộc hoàn toàn vào câu trảlời giảthuyết.", "id": "68"}, {"metadata": {"id": "RAG.pdf:5:20"}, "page_content": "Khi chủđềcủa câu hỏi không\ncó sẵn trong dữliệu được huấn luyện trước của LLM, kết quảnhận vềthường không được\nnhư mong đợi.", "id": "69"}, {"metadata": {"id": "RAG.pdf:5:21"}, "page_content": "4\nCấu phần RAG\nTrong nội dung này, chi tiết các giải pháp cho từng cấu phần của hệthống RAG: Retrieval, Augmented,\nGeneration sẽđược đềcập.", "id": "70"}, {"metadata": {"id": "RAG.pdf:5:22"}, "page_content": "Mỗi giải pháp có điểm mạnh riêng và phù hợp với các trường hợp cụthể.", "id": "71"}, {"metadata": {"id": "RAG.pdf:5:23"}, "page_content": "4.1\nTăng cường (Augmented) và Truy vấn (Retrieval) dữliệu\nTăng cường và truy vấn là cấu phần quan trọng trong việc tổchức và tìm kiếm tài liệu liên quan với\nyêu cầu người dùng (user query).", "id": "72"}, {"metadata": {"id": "RAG.pdf:5:24"}, "page_content": "Việc xây dựng một quy trình truy vấn hiệu quảluôn là vấn đềthen\nchốt trong mọi hệthống RAG.", "id": "73"}, {"metadata": {"id": "RAG.pdf:5:25"}, "page_content": "Trong các mô hình RAG, công tác tổchức truy vấn bao gồm cảnhiệm vụtăng cường (augmented)\ntổchức cơ sởdữliệu (xửlý dữliệu thô, lưu trữ, duy trì ngữnghĩa,...) và nhiệm vụtìm kiếm tài liệu\n(tra cứu thông tin liên quan theo yêu cầu của người dùng).", "id": "74"}, {"metadata": {"id": "RAG.pdf:5:26"}, "page_content": "Dưới góc nhìn của người viết, ba cấu phần\nchính của công tác Truy vấn được phân loại bao gồm: Xửlý dữliệu đầu vào (Data Structure), Xửlý\nlưu trữvà đại diện ngữnghĩa (Semantic Representation), Truy vấn - tìm kiếm (Searching).", "id": "75"}, {"metadata": {"id": "RAG.pdf:5:27"}, "page_content": "5\n", "id": "76"}, {"metadata": {"id": "RAG.pdf:6:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 5: Các nhiệm vụtrong công tác Truy vấn - Retrieval\n4.1.1\nXửlý dữliệu\nCác mô hình RAG tốt thường thích ứng với đa dạng các định dạng dữliệu đầu vào.", "id": "77"}, {"metadata": {"id": "RAG.pdf:6:1"}, "page_content": "Tuy nhiên, một số\nbài toán cho dữliệu riêng cần được thiết kếcông cụđọc và bóc tách dữliệu hiệu quả.", "id": "78"}, {"metadata": {"id": "RAG.pdf:6:2"}, "page_content": "Vềphía các mô hình ngôn ngữlớn (LLM) ởthời điểm hiện tại đều gặp giới hạn vềđộdài ngữcảnh\n(context) văn bản mà LLM có thểxửlý.", "id": "79"}, {"metadata": {"id": "RAG.pdf:6:3"}, "page_content": "Ví dụ: giới hạn 128k với GPT4 phiên bản mới nhất, 16k với\nGPT3.5, 32k với Gemini, 32k Llama-2, 8k Mixtral 8x7b,...", "id": "80"}, {"metadata": {"id": "RAG.pdf:6:4"}, "page_content": "Ngoài ra, việc đưa lượng lớn dữliệu vào ngữ\ncảnh cho LLM được chứng minh là không hiệu quả\nvới một sốvịtrí.", "id": "81"}, {"metadata": {"id": "RAG.pdf:6:5"}, "page_content": "Liu et al.", "id": "82"}, {"metadata": {"id": "RAG.pdf:6:6"}, "page_content": "(2023) bằng cách thử\nnghiệm với các ngữcảnh dài đã chỉra rằng việc sử\ndụng ngữcảnh dài sẽgặp khó khăn với các câu hỏi\nmà thông tin liên quan nằm giữa ngữcảnh.", "id": "83"}, {"metadata": {"id": "RAG.pdf:6:7"}, "page_content": "Các\ncâu hỏi sửdụng thông tin nằm ởđầu và cuối của\nngữcảnh thường cho kết quảtốt hơn.", "id": "84"}, {"metadata": {"id": "RAG.pdf:6:8"}, "page_content": "Đểgiải quyết vấn đềnày, việc chia nhỏdữliệu\nđầu vào với tham sốđộdài và chiến lược phân\nchia (chunking) phù hợp là giải pháp vô cùng quan\ntrọng.", "id": "85"}, {"metadata": {"id": "RAG.pdf:6:9"}, "page_content": "Đềbài đặt ra là xây dựng phép chia tài liệu\nmà ởđó kết quảsau khi phân chia, các thông tin\nnằm trong một đoạn phải có ý nghĩa liên quan với\nnhau và việc phân tách không được làm mất thông\ntin.", "id": "86"}, {"metadata": {"id": "RAG.pdf:6:10"}, "page_content": "Đi từgiải pháp RAG cơ bản, việc phân đoạn đơn\ngiản là phân chia đoạn theo độdài (chunk size) với\nđơn vịlà tokens, hay bổsung phân đoạn chồng lấn\n(overlap chunk) nhằm giữlại thông tin giữa các\nchunks, phân chia theo câu (Sentence Splitter).", "id": "87"}, {"metadata": {"id": "RAG.pdf:6:11"}, "page_content": "Hình 6: Hiện tượng Lost in the Middle chỉra các\nmô hình LLM thểhiện kém với việc hỏi đáp liên\nquan đến thông tin nằm ởgiữa ngữcảnh dài.", "id": "88"}, {"metadata": {"id": "RAG.pdf:6:12"}, "page_content": "Tuy nhiên các giải pháp phân chia cơ bản thường gặp nhiều vấn đềnhư không các đoạn chia (chunk)\nkhông chứa thông tin liên quan.", "id": "89"}, {"metadata": {"id": "RAG.pdf:6:13"}, "page_content": "Độdài của các phân đoạn thường là cốđịnh nên không phù hợp.", "id": "90"}, {"metadata": {"id": "RAG.pdf:6:14"}, "page_content": "Nếu\nđộdài quá lớn sẽdẫn đến khó tìm kiếm với thông tin chi tiết.", "id": "91"}, {"metadata": {"id": "RAG.pdf:6:15"}, "page_content": "Nếu độdài quá ngắn sẽdẫn đến khó có\nđược bối cảnh tổng quan. Với giải pháp RAG nâng cao, các hướng tiếp cận hiệu quảhơn được đềcập nhằm đưa ra các phương\nán chia nhỏtối ưu đểcó thểvừa nâng cao khảnăng tìm kiếm chi tiết mà vẫn có được thông tin bối\n6\n", "id": "92"}, {"metadata": {"id": "RAG.pdf:7:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\ncảnh.", "id": "93"}, {"metadata": {"id": "RAG.pdf:7:1"}, "page_content": "Độdài của các phân đoạn có thểlinh hoạt ấn định cho phù hợp với nội dung ngữnghĩa.", "id": "94"}, {"metadata": {"id": "RAG.pdf:7:2"}, "page_content": "Một số\ngiải pháp có thểkểđến như sau:\n• Sentence Window: là giải pháp phân chia theo câu kết hợp cửa sổmởrộng.", "id": "95"}, {"metadata": {"id": "RAG.pdf:7:3"}, "page_content": "Dữliệu được ngữ\nnghĩa hoá (word2vec) là đơn vịcâu, tuy nhiên dữliệu trảvềlà dữliệu mởrộng cho câu lân cận.", "id": "96"}, {"metadata": {"id": "RAG.pdf:7:4"}, "page_content": "Tham sốđộrộng cửa sổđược khai báo cho phép người dùng tuỳchỉnh độdài văn bản trảvề.", "id": "97"}, {"metadata": {"id": "RAG.pdf:7:5"}, "page_content": "• Hierarchical Splitter: là giải pháp chia nhỏdữliệu theo nhiều cấp.", "id": "98"}, {"metadata": {"id": "RAG.pdf:7:6"}, "page_content": "Trong đó, các cấp được\nphân loại theo độdài và được ví như các đoạn mẹ(parent) và các đoạn con (child).", "id": "99"}, {"metadata": {"id": "RAG.pdf:7:7"}, "page_content": "Các đoạn mẹ\ncó độdài lớn hơn sẽbao gồm nhiều đoạn con, đoạn mẹmang thông tin vềngữcảnh.", "id": "100"}, {"metadata": {"id": "RAG.pdf:7:8"}, "page_content": "Ngược lại,\ncác đoạn con có độdài ngắn hơn sẽchứa thông tin chi tiết vềcác đối tượng, phù hợp hơn cho các\nphép tìm kiếm chi tiết.", "id": "101"}, {"metadata": {"id": "RAG.pdf:7:9"}, "page_content": "Giải pháp này cho phép việc truy vấn có thểtìm kiếm với thông tin chi\ntiết mà không bịmất đi dữkiện bối cảnh.", "id": "102"}, {"metadata": {"id": "RAG.pdf:7:10"}, "page_content": "• Semantic Splitter: Kamradt (2024) đã giới\nthiệu giải pháp phân đoạn thông minh nhằm tối\nưu sựliên quan của các câu trong văn bản.", "id": "103"}, {"metadata": {"id": "RAG.pdf:7:11"}, "page_content": "Giải\npháp sửdụng một mô hình embedding đểđại\ndiện ngữnghĩa cho các phân đoạn.", "id": "104"}, {"metadata": {"id": "RAG.pdf:7:12"}, "page_content": "Tác giảcoi\nmỗi câu văn như một đơn vịtrong một bài toán\nchuỗi thời gian (Time Series).", "id": "105"}, {"metadata": {"id": "RAG.pdf:7:13"}, "page_content": "Một thuật toán\nchạy lặp qua các cửa sổđược thực hiện đểtìm\nra điểm ngắt của các phân đoạn không liên quan\nvới nhau vềmặt ngữnghĩa.", "id": "106"}, {"metadata": {"id": "RAG.pdf:7:14"}, "page_content": "Theo cách tiếp cận\nnày, việc phân chia văn bản được thực hiện tự\nđộng mà vẫn giữđược thông tin liên quan giữa\ncác câu văn trong cùng một phân đoạn (chunk).", "id": "107"}, {"metadata": {"id": "RAG.pdf:7:15"}, "page_content": "Hình 7: Giải pháp Semantic Splitter.", "id": "108"}, {"metadata": {"id": "RAG.pdf:7:16"}, "page_content": "• Agentic Splitter: Cũng trong phần trình bày của mình Kamradt (2024) đã giới thiệu giải pháp\nchia nhỏAgentic dựa trên bài báo Chen et al.", "id": "109"}, {"metadata": {"id": "RAG.pdf:7:17"}, "page_content": "(2023).", "id": "110"}, {"metadata": {"id": "RAG.pdf:7:18"}, "page_content": "• Enhancing Semantic Representations, Aligning Queries and Documents, Aligning Re-\ntriever and LLM\nXửlý dữliệu dạng bảng: Bên cạnh các giải pháp xửlý dữliệu chữ, thông tin từhệthống bảng biểu\ncũng được cân nhắc.", "id": "111"}, {"metadata": {"id": "RAG.pdf:7:19"}, "page_content": "Bởi việc bóc tách xửlý chữthông thường không giữlại được cấu trúc và mối quan\nhệtrong các bảng biểu.", "id": "112"}, {"metadata": {"id": "RAG.pdf:7:20"}, "page_content": "Các phương pháp đơn giản sẽchuyển đổi cấu trúc bảng thành các cấu trúc dễ\nhiểu hơn với máy như markdown hoặc html. 7\n", "id": "113"}, {"metadata": {"id": "RAG.pdf:8:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 8: Xửlý thông tin dạng bảng với phép biến đổi markdown và html. Thông tin trích xuất trực tiếp\nvới Raw-text cho thấy cấu trúc bảng không rõ ràng.", "id": "114"}, {"metadata": {"id": "RAG.pdf:8:1"}, "page_content": "Cấu trúc bảng của markdown và html cho phép\ncác LLM dễhiểu hơn nội dung trong bảng.", "id": "115"}, {"metadata": {"id": "RAG.pdf:8:2"}, "page_content": "Dữliệu có cấu trúc: Một sốgiải pháp coi dữliệu dạng bảng như một nguồn dữliệu cung cấp\ncác thông tin chính xác.", "id": "116"}, {"metadata": {"id": "RAG.pdf:8:3"}, "page_content": "Các giải pháp này tập trung vào việc nâng cao khảnăng suy luận và truy vấn\nthông tin từcác cơ sởdữliệu có cấu trúc.Wang et al.", "id": "117"}, {"metadata": {"id": "RAG.pdf:8:4"}, "page_content": "(2024) đềcập giải pháp có tên gọi Chain of Table,\ntrong đó phương pháp thiết lập một chuỗi các lập luận với LLM đểthực thi các truy vấn nhằm đạt\nđược kết quảliên quan nhất với câu hỏi đầu vào.", "id": "118"}, {"metadata": {"id": "RAG.pdf:8:5"}, "page_content": "Hình 9: So sánh giải pháp truy vấn thông tin bảng biểu (a) generic reasoning, (b) program-aided\nreasoning, and (c) CHAIN-OF-TABLE..", "id": "119"}, {"metadata": {"id": "RAG.pdf:8:6"}, "page_content": "Knowledge Graph: Bên cạnh các kiến trúc lưu trữdữliệu truyền thống, Graph database hay\n8\n", "id": "120"}, {"metadata": {"id": "RAG.pdf:9:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nKnowledge Graph được cân nhắc như một giải pháp hiệu quảđểquản lý kiến thức. Bởi sựphát triển\nmối quan hệtheo chiều ngang, việc thiết lập các lập luận (reasoning) được thực hiện dễdàng hơn.", "id": "121"}, {"metadata": {"id": "RAG.pdf:9:1"}, "page_content": "Tuy\nnhiên, các mô hình Knowledge Graph thường tốn công sức đểxây dựng hơn các kiến trúc dữliệu khác.", "id": "122"}, {"metadata": {"id": "RAG.pdf:9:2"}, "page_content": "4.1.2\nEmbedding Models\nTrong các tác vụxửlý ngôn ngữ, embeddings đóng vai trò chuyển đổi, đại diện thông tin từcác các\nchủthểnhư hình ảnh, âm thanh hay chữ.", "id": "123"}, {"metadata": {"id": "RAG.pdf:9:3"}, "page_content": "Trong giải pháp RAG, embeddings được sửdụng trong thuật\ntoán tìm kiếm theo ngữnghĩa (semantic search).", "id": "124"}, {"metadata": {"id": "RAG.pdf:9:4"}, "page_content": "Vềmặt toán học, kết quảembeddings được lưu trữdưới dạng các vector.", "id": "125"}, {"metadata": {"id": "RAG.pdf:9:5"}, "page_content": "Mỗi vector là một chuỗi\ncác số, trong đó mỗi sốtương ướng với một chiều không gian.", "id": "126"}, {"metadata": {"id": "RAG.pdf:9:6"}, "page_content": "Tại các chiều không gian đó, thuật toán\ntìm kiếm tương đồng (similar) được thực thi đểtìm ra các vector gần nhau trong cơ sởdữliệu vector.", "id": "127"}, {"metadata": {"id": "RAG.pdf:9:7"}, "page_content": "Như vậy, mục tiêu của embeddings là việc đại diện hoá thông tin từngữcảnh (chữ) sang không gian\nvector sao cho các thông tin có nghĩa giống nhau sẽcó khoảng cách gần nhau.", "id": "128"}, {"metadata": {"id": "RAG.pdf:9:8"}, "page_content": "Hình 10: Embedding đại diện thông tin văn bản dưới dạng vector.", "id": "129"}, {"metadata": {"id": "RAG.pdf:9:9"}, "page_content": "Các mô hình embedding: Muennighoff et al.", "id": "130"}, {"metadata": {"id": "RAG.pdf:9:10"}, "page_content": "(2023) đã thực hiện đánh giá 08 tác vụembedding\ntrên 15 tập dataset, phủ112 ngôn ngữ.", "id": "131"}, {"metadata": {"id": "RAG.pdf:9:11"}, "page_content": "Kết quảcủa đánh giá được thểhiện trên một bảng xếp hạng\nchất lượng của các mô hình embeddings.", "id": "132"}, {"metadata": {"id": "RAG.pdf:9:12"}, "page_content": "Hình 11: Kết quảđánh giá mô hình embeddings dựa trên mức độthểhiện, tốc độ, sốchiều, kích thước\ndữliệu.", "id": "133"}, {"metadata": {"id": "RAG.pdf:9:13"}, "page_content": "Đánh giá được thực hiện trên phần cứng Nvidia A100 80GB, CUDA 11.6.", "id": "134"}, {"metadata": {"id": "RAG.pdf:9:14"}, "page_content": "9\n", "id": "135"}, {"metadata": {"id": "RAG.pdf:10:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nDựa trên kết quảđánh giá, một bảng xếp hạng các mô hình embedding đã được xây dựng dựa vào\ncác tiêu chí.", "id": "136"}, {"metadata": {"id": "RAG.pdf:10:1"}, "page_content": "Hình 12: Bảng xếp hạng các mô hình embeddings dựa trên kết quảđánh giá của Muennighoff et al.", "id": "137"}, {"metadata": {"id": "RAG.pdf:10:2"}, "page_content": "(2023)\nHiệu chỉnh (fine-tuning) mô hình embedding: Trong các giải pháp RAG, hiệu chỉnh embedding\nlà một cách được cân nhắc đểcải thiện chất lượng truy vấn.", "id": "138"}, {"metadata": {"id": "RAG.pdf:10:3"}, "page_content": "Các mô hình embedding gốc không được\nhuấn luyện với dữliệu riêng của người dùng nên việc đại diện ngữnghĩa có thểkhông hoàn toàn tốt.", "id": "139"}, {"metadata": {"id": "RAG.pdf:10:4"}, "page_content": "Công tác hiệu chỉnh mô hình embedding là quá trình cập nhật lại tham sốcủa mô hình với nhằm đưa\nthêm thông tin dữliệu riêng vào mô hình.", "id": "140"}, {"metadata": {"id": "RAG.pdf:10:5"}, "page_content": "Các bước thực hiện hiệu chỉnh mô hình bao gồm:\n• Tạo dữliệu huấn luyện: Bên cạnh việc xây dựng các tập dữliệu huấn luyện một cách thủcông,\nnhiều giải pháp sửdụng các mô hình ngôn ngữlớn đểtạo dataset được sửdụng.", "id": "141"}, {"metadata": {"id": "RAG.pdf:10:6"}, "page_content": "Trong đó, LLM\ntạo ra câu hỏi giảthuyết tương ứng với thông tin chứa trong đoạn văn bản đểtạo ra bộcâu hỏi -\nđoạn chứa thông tin liên quan.", "id": "142"}, {"metadata": {"id": "RAG.pdf:10:7"}, "page_content": "• Hiệu chỉnh mô hình embedding: Sửdụng tập dữliệu được chuẩn bịtrước và một mô hình\nembedding mã nguồn mởvới thuật toán SentenceTransformers, việc huấn luyện hiệu chỉnh mô\nhình được thực hiện cùng các phép đánh giá đảm bảo mô hình đầu ra phù hợp với các tác vụtruy\nvấn.", "id": "143"}, {"metadata": {"id": "RAG.pdf:10:8"}, "page_content": "Code tham khảo cho hiệu chỉnh embedding model được viết bởi Jerry Liu.", "id": "144"}, {"metadata": {"id": "RAG.pdf:10:9"}, "page_content": "• Đánh giá mô hình: Đánh giá được thực thi đểkiểm tra chất lượng mô hình sau khi hiệu chỉnh.", "id": "145"}, {"metadata": {"id": "RAG.pdf:10:10"}, "page_content": "Thông thường, việc hiệu chỉnh tốt sẽtăng cường chất lượng của mô hình hỏi đáp từ5-10 phần\ntrăm. 4.1.3\nGiải pháp truy vấn (Retrieval)\nDữliệu sau khi xửlý được lưu trữtrên các cơ sởdữliệu như Vector database, Knowledge graph hay\nnon-sql (Mongodb).", "id": "146"}, {"metadata": {"id": "RAG.pdf:10:11"}, "page_content": "Công việc tiếp theo là thực thi các truy vấn.", "id": "147"}, {"metadata": {"id": "RAG.pdf:10:12"}, "page_content": "Mục tiêu là truy vấn được các thông\ntin liên quan nhất với câu hỏi đầu vào.", "id": "148"}, {"metadata": {"id": "RAG.pdf:10:13"}, "page_content": "Một sốgiải pháp có thểđềcập đến như:\n10\n", "id": "149"}, {"metadata": {"id": "RAG.pdf:11:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\n• Viết lại câu hỏi: Trong quá trình hỏi đáp, việc làm rõ câu hỏi đầu vào giúp cho việc tổchức\ntruy vấn hiệu quả.", "id": "150"}, {"metadata": {"id": "RAG.pdf:11:1"}, "page_content": "Việc sửdụng một LLM có hướng dẫn (instruction) đểviết lại câu hỏi đầu vào\ncủa người dùng là giải pháp phù hợp với những câu hỏi quá đơn giản hoặc quá phức tạp.", "id": "151"}, {"metadata": {"id": "RAG.pdf:11:2"}, "page_content": "• Hypothetical Document Embedding: Tạo ra câu hỏi giảthuyết đểphục vụembedding và\ntìm kiếm thông tin liên quan.", "id": "152"}, {"metadata": {"id": "RAG.pdf:11:3"}, "page_content": "• Hybrid Search and Reranker: Áp dụng tìm kiếm với từkhoá và ngữnghĩa sau đó thực hiện\nxếp hạng lại kết quảtìm kiếm giúp nâng cao kết quảso với việc tìm kiếm đơn thuần với một\nphương pháp.", "id": "153"}, {"metadata": {"id": "RAG.pdf:11:4"}, "page_content": "• Metadata Filter: Giải pháp sửdụng thông tin bổsung đểtạo bộlọc được sửdụng khi nắm rõ\nđược cấu trúc của cơ sởdữliệu cũng như nắm được các trường hợp truy vấn.", "id": "154"}, {"metadata": {"id": "RAG.pdf:11:5"}, "page_content": "Bộlọc tìm kiếm\ngiúp thu gọn phạm vi tìm kiếm, nâng cao chất lượng truy vấn.", "id": "155"}, {"metadata": {"id": "RAG.pdf:11:6"}, "page_content": "4.2\nMô hình sinh ngôn ngữ(Generation)\nGeneration là công đoạn cuối trong chu trình RAG với nhiệm vụchuyển đổi thông tin nhận được từ\nbối cảnh thành câu trảlời cho câu hỏi đầu vào của người dùng thông qua một mô hình ngôn ngữlớn. Quá trình sinh câu trảlời cần đảm bảo câu trảlời đầu ra sửdụng thông tin từngữcảnh được cung\ncấp, hạn chếcâu trảlời sai (hallucination).", "id": "156"}, {"metadata": {"id": "RAG.pdf:11:7"}, "page_content": "Với các yêu cầu vềchất lượng, các giải pháp có thểtiếp cận đểnâng cao kết quảbao gồm tối ưu\nhoá kết quảtìm kiếm từkhâu truy vấn (retrieval) bằng các giải pháp hậu truy vấn.", "id": "157"}, {"metadata": {"id": "RAG.pdf:11:8"}, "page_content": "Quá trình sinh văn\nbản có thểđược tác đông bằng các phương thức:\n• Prompt Engineering: Prompt Engineering là giải pháp can thiệp vào cách trảlời của LLM mà\nkhông cần hiệu chỉnh lại bộtham sốgốc.", "id": "158"}, {"metadata": {"id": "RAG.pdf:11:9"}, "page_content": "Prompt Engineering đóng vai trò như một bộlọc trong\nquá trình sinh ngôn ngữđảm bảo kết quảđầu ra theo phong cách trình bày mong muốn.", "id": "159"}, {"metadata": {"id": "RAG.pdf:11:10"}, "page_content": "Ngoài\nra, một sốgiải pháp như yêu cầu LLM không tạo ra câu trảlời nếu không có đủthông tin sẽgiúp\nhạn chếviệc hallucination.", "id": "160"}, {"metadata": {"id": "RAG.pdf:11:11"}, "page_content": "Trong trường hợp khác khi ngữcảnh không đủdữkiện, hãy sửdụng\ndữliệu được huấn luyện cũng là giải pháp tốt.", "id": "161"}, {"metadata": {"id": "RAG.pdf:11:12"}, "page_content": "Bên cạnh đó, trong các kiến trúc RAG kết hợp\nMulti-Agents, prompt engineering đóng vai trò cốt lõi trong việc điều hướng Agents đểtạo ra sự\nmượt mà ởgiải pháp cuối.", "id": "162"}, {"metadata": {"id": "RAG.pdf:11:13"}, "page_content": "11\n", "id": "163"}, {"metadata": {"id": "RAG.pdf:12:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 13: Kojima et al. (2023) sửdụng Zero-Shot-CoT đểcải thiện chất lượng câu trảlời của LLM\n• Hiệu chỉnh mô hình ngôn ngữlớn (Fine-tuning LLM): Công tác hiệu chỉnh mô hình ngôn\nngữlớn thực hiện việc huấn luyện lại một phần tham sốcủa mô hình LLM gốc.", "id": "164"}, {"metadata": {"id": "RAG.pdf:12:1"}, "page_content": "Các dữliệu huấn\nluyện được chuẩn bịtrước từnguồn dữliệu riêng, chưa được học bởi LLM.", "id": "165"}, {"metadata": {"id": "RAG.pdf:12:2"}, "page_content": "Công tác huấn luyện\nsẽghi đè một phần tham sốtrong bộtham sốgốc.", "id": "166"}, {"metadata": {"id": "RAG.pdf:12:3"}, "page_content": "Giải pháp Fine-tuning được đánh giá là giải\npháp hiệu quảcho chất lượng kiểm soát tốt khi lượng dữliệu huấn luyện đầy đủ, phủkhắp các\ntrường hợp hỏi đáp.", "id": "167"}, {"metadata": {"id": "RAG.pdf:12:4"}, "page_content": "Điểm trừcủa giải pháp là giải pháp yêu cầu nhiều công sức cho việc chuẩn\nbịdữliệu, nhiều tài nguyên cho việc huấn luyên bổsung cho mô hình ngôn ngữlớn.", "id": "168"}, {"metadata": {"id": "RAG.pdf:12:5"}, "page_content": "Bên cạnh đó,\nngười xây dựng cũng cần có kiến thức và kỹthuật làm việc với mô hình tốt, tránh trường hợp kết\nquảsau khi fine-tuning tệhơn trước khi fine-tuning.", "id": "169"}, {"metadata": {"id": "RAG.pdf:12:6"}, "page_content": "4.3\nĐánh giá hệthống RAG\nGiống với các loại mô hình khác, việc đánh giá mô hình luôn là yếu tốquan trọng đểđánh giá chất\nlượng của giải pháp.", "id": "170"}, {"metadata": {"id": "RAG.pdf:12:7"}, "page_content": "Thông thường, hệthống RAG được đánh giá bằng việc đo lường mức độthểhiện\ntrong các tác vụcuối (hỏi đáp).", "id": "171"}, {"metadata": {"id": "RAG.pdf:12:8"}, "page_content": "Hệthống đánh giá RAG đo lường hai yếu tốchính là khảnăng truy\nvấn dữliệu (retrieval) và khảnăng sinh câu trảlời (generation).", "id": "172"}, {"metadata": {"id": "RAG.pdf:12:9"}, "page_content": "Công tác đánh giá RAG tập trung vào ba yếu tốđo lường và bốn khảnăng.", "id": "173"}, {"metadata": {"id": "RAG.pdf:12:10"}, "page_content": "Ba yếu tốđo lường gồm\n\"context relevance\" (sựchính xác của kết quảtìm kiếm), \"answer faithfulness\" (sựthành thực của câu\ntrảlời với ngữcảnh), \"answer relevance\" (sựliên quan giữa câu trảlời và câu hỏi).", "id": "174"}, {"metadata": {"id": "RAG.pdf:12:11"}, "page_content": "Bên cạnh đó, bốn\nkhảnăng được cân nhắc bao gồm: \"noise robustness\", \"negative rejection\", \"information integration\",\nvà \"counterfactual robustness\".", "id": "175"}, {"metadata": {"id": "RAG.pdf:12:12"}, "page_content": "12\n", "id": "176"}, {"metadata": {"id": "RAG.pdf:13:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 14: Gao et al. (2024) đã hệthống các giải pháp đánh giá hệthống RAG và danh sách các công cụ\nsửdụng đểđánh giá.", "id": "177"}, {"metadata": {"id": "RAG.pdf:13:1"}, "page_content": "Việc tựđộng hoá công tác đánh giá các hệthống RAG ngày càng phổbiến với sựxuất hiện của các\ncông cụnhư RAGAS, ARES, TruLens.", "id": "178"}, {"metadata": {"id": "RAG.pdf:13:2"}, "page_content": "Phần III: Advanced RAG\nỞphần này chúng ta sẽcùng tìm hiểu vềvấn đềcủa Naive RAG và một sốkỹthuật RAG nâng cao\nnhằm nâng cao chất lượng cho một hệthống sửdụng RAG.", "id": "179"}, {"metadata": {"id": "RAG.pdf:13:3"}, "page_content": "5\nVấn đềcủa Naive RAG\nRAG đã nhanh chóng được ứng dụng rộng rãi trong nhiều sản phẩm và dịch vụ, nó đóng vai trò quan\ntrọng trong việc cải thiện khảnăng tương tác và trải nghiệm người dùng bằng cách cung cấp câu trả\nlời chính xác và tức thời cho các truy vấn phức tạp.", "id": "180"}, {"metadata": {"id": "RAG.pdf:13:4"}, "page_content": "Tuy nhiên, sựphổbiến và tính ứng dụng rộng rãi\n13\n", "id": "181"}, {"metadata": {"id": "RAG.pdf:14:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\ncủa RAG cũng dẫn đến một loạt thách thức cần giải quyết.", "id": "182"}, {"metadata": {"id": "RAG.pdf:14:1"}, "page_content": "Vấn đềchính mà RAG đối mặt là việc tối\nưu hóa hiệu suất của nó, cụthểlà làm thếnào đểquá trình truy xuất thông tin diễn ra nhanh chóng\nhơn và kết quảthu được chính xác hơn.", "id": "183"}, {"metadata": {"id": "RAG.pdf:14:2"}, "page_content": "Bây giờchúng ta sẽtìm hiểu một sốlý do mà một hệthống\nNaive RAG sẽgặp phải làm ảnh hưởng tới hiệu suất của nó. Hình 15: Một sốvấn đềcủa Naive RAG\nVới hình trên chúng ta thấy rằng cảba quá trình Indexing, Retrieval và Generation đều gặp phải\nnhững vấn đềriêng của chúng.", "id": "184"}, {"metadata": {"id": "RAG.pdf:14:3"}, "page_content": "Những vấn đềnày có thểlà độc lập hoặc liên quan với nhau để\"cùng\n14\n", "id": "185"}, {"metadata": {"id": "RAG.pdf:15:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nnhau\" làm giảm hiệu suất của hệthống RAG.", "id": "186"}, {"metadata": {"id": "RAG.pdf:15:1"}, "page_content": "Với quá trình Indexing:\n• Quá trình Indexing còn chưa hoàn thiện, vì nó chưa xửlý hiệu quảthông tin hữu ích trong hình\nảnh, biểu đồvà bảng biểu trong các tệp dữliệu không cấu trúc như PDF.", "id": "187"}, {"metadata": {"id": "RAG.pdf:15:2"}, "page_content": "• Quá trình chunking sửdụng chiến lược “one-size-fits-all” thay vì chọn lựa các chiến lược tối ưu\ndựa trên đặc điểm của các loại tệp khác nhau.", "id": "188"}, {"metadata": {"id": "RAG.pdf:15:3"}, "page_content": "Điều này đã dẫn đến việc mỗi phần chứa thông tin\nngữnghĩa chưa đầy đủ.", "id": "189"}, {"metadata": {"id": "RAG.pdf:15:4"}, "page_content": "Hơn nữa, nó không xem xét các chi tiết quan trọng, như các tiêu đềhiện\ncó trong văn bản.", "id": "190"}, {"metadata": {"id": "RAG.pdf:15:5"}, "page_content": "• Cấu trúc indexing chưa được tối ưu hóa đủmức, dẫn đến chức năng truy xuất chưa hiệu quả.", "id": "191"}, {"metadata": {"id": "RAG.pdf:15:6"}, "page_content": "• Khảnăng biểu diễn ngữnghĩa của embedding model chưa đủmạnh.", "id": "192"}, {"metadata": {"id": "RAG.pdf:15:7"}, "page_content": "Đối với quá trình Retrieval\n• Mức độliên quan của các ngữcảnh được ghi nhớkhông đủvà độchính xác thấp.", "id": "193"}, {"metadata": {"id": "RAG.pdf:15:8"}, "page_content": "• Recall Rate thấp ngăn cản việc truy vấn tất cảcác đoạn văn bản liên quan, do đó cản trởkhả\nnăng của LLMs trong việc tạo ra các câu trảlời toàn diện.", "id": "194"}, {"metadata": {"id": "RAG.pdf:15:9"}, "page_content": "• Truy vấn có thểkhông chính xác hoặc khảnăng biểu diễn ngữnghĩa của embedding model có thể\nyếu, dẫn đến khảnăng không thểtruy vấn thông tin có giá trị.", "id": "195"}, {"metadata": {"id": "RAG.pdf:15:10"}, "page_content": "• Thuật toán truy vấn bịhạn chếvì nó không kết hợp các loại phương pháp hoặc thuật toán truy\nvấn khác nhau, như kết hợp truy vấn từkhóa, ngữnghĩa và vector.", "id": "196"}, {"metadata": {"id": "RAG.pdf:15:11"}, "page_content": "• Sựtrùng lặp thông tin xảy ra khi nhiều ngữcảnh được truy vấn chứa thông tin tương tự, dẫn đến\nnội dung lặp lại trong các câu trảlời được tạo ra.", "id": "197"}, {"metadata": {"id": "RAG.pdf:15:12"}, "page_content": "Đối với quá trình Generation\n• Việc tích hợp hiệu quảgiữa hai tác vụretrieved context và generation có thểkhông khảthi, dẫn\nđến kết quảkhông nhất quán.", "id": "198"}, {"metadata": {"id": "RAG.pdf:15:13"}, "page_content": "• Sựphụthuộc quá mức vào thông tin được cải thiện trong quá trình generation mang lại rủi ro\ncao.", "id": "199"}, {"metadata": {"id": "RAG.pdf:15:14"}, "page_content": "Điều này có thểdẫn đến việc tạo ra những kết quảchỉđơn giản lặp lại nội dung đã truy vấn\nmà không cung cấp thông tin có giá trị.", "id": "200"}, {"metadata": {"id": "RAG.pdf:15:15"}, "page_content": "• LLM có thểtạo ra các phản hồi sai, không liên quan, có hại, hoặc thiên vị. 6\nUnveiling PDF Parsing\nViệc trích xuất thông tin từtài liệu, đặc biệt là từcác tệp PDF không cấu trúc, đã trởthành một yếu\ntốkhông thểthiếu trong việc cải thiện chất lượng và hiệu suất của các hệthống tựđộng như RAG.", "id": "201"}, {"metadata": {"id": "RAG.pdf:15:16"}, "page_content": "Quá trình này yêu cầu một sựchú ý đặc biệt với mục tiêu đảm bảo rằng nội dung được trích xuất một\ncách chính xác và hiệu quả, từđó nâng cao giá trịcủa sản phẩm cuối cùng.", "id": "202"}, {"metadata": {"id": "RAG.pdf:15:17"}, "page_content": "Việc ứng dụng công nghệ\nphân tích cú pháp thông tin từnhững tài liệu này là cực kỳquan trọng, bởi vì dữliệu không cấu trúc\nchiếm một tỷlệlớn trong dữliệu được tạo ra và lưu trữhằng ngày.", "id": "203"}, {"metadata": {"id": "RAG.pdf:15:18"}, "page_content": "Tài liệu PDF, vốn là một trong những dạng phổbiến nhất của dữliệu không cấu trúc, yêu cầu các\nphương pháp tiếp cận đặc thù đểcó thểkhai thác trọn vẹn giá trịthông tin bên trong vì vậy việc trích\nxuất thông tin từtài liệu PDF lại là một quá trình đầy thách thức.", "id": "204"}, {"metadata": {"id": "RAG.pdf:15:19"}, "page_content": "Thay vì là một định dạng dữliệu,\nPDF chính xác hơn khi được mô tảlà một tập hợp các hướng dẫn in ấn.", "id": "205"}, {"metadata": {"id": "RAG.pdf:15:20"}, "page_content": "Một tệp PDF bao gồm một\n15\n", "id": "206"}, {"metadata": {"id": "RAG.pdf:16:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nloạt hướng dẫn cho máy đọc hoặc máy in PDF biết cách hiển thịcác ký tựtrên màn hình hoặc giấy. Điều này trái ngược với các định dạng tệp như HTML và docx, sửdụng các thẻnhư <p>, <w:p>,\n<table>, và <w:tbl> đểtổchức các cấu trúc logic khác nhau.", "id": "207"}, {"metadata": {"id": "RAG.pdf:16:1"}, "page_content": "Thách thức trong việc phân tích cú pháp\ntài liệu PDF nằm ởviệc chính xác trích xuất bốcục của toàn bộtrang và dịch nội dung, bao gồm bảng,\ntiêu đề, đoạn văn, và hình ảnh, thành một biểu diễn văn bản của tài liệu.", "id": "208"}, {"metadata": {"id": "RAG.pdf:16:2"}, "page_content": "Quá trình này đòi hỏi phải\nxửlý những không chính xác trong trích xuất văn bản, nhận dạng hình ảnh, và sựnhầm lẫn vềmối\nquan hệhàng-cột trong bảng.", "id": "209"}, {"metadata": {"id": "RAG.pdf:16:3"}, "page_content": "Hình 16: HTML và PDF\nThông thường chúng ta sẽcó ba cách tiếp cận cơ bản đểparse tài liệu PDF:\n• Rule-based approach: nơi mà phong cách và nội dung của từng phần được xác định dựa trên đặc\nđiểm tổchức của tài liệu.", "id": "210"}, {"metadata": {"id": "RAG.pdf:16:4"}, "page_content": "• Deep learning models: Sửdụng một sốmodel kết hợp như Optical Character Recognition, Docu-\nment Layout Analysis, Key Information Extraction,...", "id": "211"}, {"metadata": {"id": "RAG.pdf:16:5"}, "page_content": "• Phân tích cấu trúc phức tạp hoặc trích xuất thông tin chính trong PDF dựa trên các multimodal\nlarge models.", "id": "212"}, {"metadata": {"id": "RAG.pdf:16:6"}, "page_content": "16\n", "id": "213"}, {"metadata": {"id": "RAG.pdf:17:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 17: Hình minh họa cho việc kết hợp nhiều Deep learning Model cho quá trình parse PDF\n7\nRe-ranking\nRe-ranking đóng vai trò quan trọng trong RAG. Trong naive RAG, một sốlượng lớn ngữcảnh có thể\nđược truy vấn, nhưng không phải tất cảđều cần thiết liên quan đến câu hỏi.", "id": "214"}, {"metadata": {"id": "RAG.pdf:17:1"}, "page_content": "Re-ranking cho phép sắp\nxếp lại và lọc các tài liệu, đặt những cái liên quan lên hàng đầu, từđó nâng cao hiệu quảcủa RAG.", "id": "215"}, {"metadata": {"id": "RAG.pdf:17:2"}, "page_content": "Nhiệm vụcủa re-ranking là đánh giá mức độliên quan của các ngữcảnh này và ưu tiên những cái có\nkhảnăng cung cấp câu trảlời chính xác và liên quan nhất.", "id": "216"}, {"metadata": {"id": "RAG.pdf:17:3"}, "page_content": "Điều này cho phép LLM ưu tiên những ngữ\ncảnh được xếp hạng cao này khi tạo ra câu trảlời, từđó cải thiện độchính xác và chất lượng của phản\nhồi.", "id": "217"}, {"metadata": {"id": "RAG.pdf:17:4"}, "page_content": "Các phương pháp re-ranking chủyếu được chia thành hai loại:\n• Re-ranking models: những mô hình này xem xét các đặc điểm tương tác giữa tài liệu và truy vấn\nđểđánh giá mức độliên quan một cách chính xác hơn.", "id": "218"}, {"metadata": {"id": "RAG.pdf:17:5"}, "page_content": "• Large Language Model: sựxuất hiện của mô hình ngôn ngữlớn đã mởra những khảnăng mới\ncho việc re-ranking.", "id": "219"}, {"metadata": {"id": "RAG.pdf:17:6"}, "page_content": "Bằng cách hiểu sâu toàn bộtài liệu và truy vấn, có thểnắm bắt thông tin\nngữnghĩa một cách toàn diện hơn.", "id": "220"}, {"metadata": {"id": "RAG.pdf:17:7"}, "page_content": "8\nExploring Semantic Chunking\n9\nExploring Query Rewriting\nPhần VI: Research in RAG\n9.1\nFLARE\nhttps://arxiv.org/pdf/2305.06983.pdf\n17\n", "id": "221"}, {"metadata": {"id": "RAG.pdf:18:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nTrong bài báo \"Active Retrieval Augmented Generation\" Jiang et al., 2023, các tác giảgiới thiệu\nphương pháp mới có tên FLARE, viết tắt của Forward-Looking Active Retrieval Augmented Generation. Phương pháp này cho phép các mô hình ngôn ngữlớn tích cực lựa chọn thời điểm và loại thông tin cần\ntruy vấn trong suốt quá trình tạo ra văn bản.", "id": "222"}, {"metadata": {"id": "RAG.pdf:18:1"}, "page_content": "FLARE hoạt động bằng cách tạo ra các câu tạm thời,\nvà nếu nhận thấy có từnào trong câu đó không chắc chắn, nó sẽtìm kiếm thông tin liên quan đểcải\nthiện câu tiếp theo.", "id": "223"}, {"metadata": {"id": "RAG.pdf:18:2"}, "page_content": "Điều này tiếp tục diễn ra cho đến khi hoàn thành văn bản.", "id": "224"}, {"metadata": {"id": "RAG.pdf:18:3"}, "page_content": "Một ưu điểm đáng chú\ný là FLARE có thểáp dụng cho bất kỳmô hình ngôn ngữnào mà không cần phải huấn luyện lại từ\nđầu.", "id": "225"}, {"metadata": {"id": "RAG.pdf:18:4"}, "page_content": "Bài báo cũng trình bày hai cách thức truy vấn chủđộng khác nhau: phương pháp đầu tiên, gọi là\nFLAREinstruct, tạo ra truy vấn dựa trên một chỉdẫn đặc biệt đểkhuyến khích việc truy vấn thông tin,\ntrong khi phương pháp thứhai, FLAREdirect, sửdụng kết quảtạo sinh trực tiếp từmô hình ngôn ngữ\nlàm truy vấn, đặc biệt khi có từkhông chắc chắn trong câu đó.", "id": "226"}, {"metadata": {"id": "RAG.pdf:18:5"}, "page_content": "FLAREntruct: Một phương pháp đơn giản đểtạo ra thông tin truy vấn trong quá trình tạo nội dung\nlà sửdụng token đặc biệt \"[Search(query)]\" mỗi khi cần thông tin bổsung.", "id": "227"}, {"metadata": {"id": "RAG.pdf:18:6"}, "page_content": "Khi mô hình ngôn ngữsinh\nra token này, quá trình tạo nội dung tạm thời dừng lại, và câu truy vấn bên trong token sẽđược dùng\nđểtìm kiếm thông tin liên quan.", "id": "228"}, {"metadata": {"id": "RAG.pdf:18:7"}, "page_content": "Phương pháp này được lấy cảm hứng từnghiên cứu \"Toolformer:\nLanguage Models Can Teach Themselves to Use Tools\" Schick et al., 2023.", "id": "229"}, {"metadata": {"id": "RAG.pdf:18:8"}, "page_content": "18\n", "id": "230"}, {"metadata": {"id": "RAG.pdf:19:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nFLAREdirect Trong phương pháp FLAREinstruct, có lúc các câu truy vấn được tạo ra không chính\nxác, làm giảm độtin cậy của quá trình truy vấn. Đểgiải quyết vấn đềnày, bài báo đềxuất một cách\ntiếp cận truy vấn chủđộng khác, dựa vào việc xem xét câu tiếp theo đểquyết định thời điểm truy vấn.", "id": "231"}, {"metadata": {"id": "RAG.pdf:19:1"}, "page_content": "Cụthể, mô hình ngôn ngữsẽtrước tiên tạo ra một câu tiếp theo mà không dựa vào kết quảtruy vấn.", "id": "232"}, {"metadata": {"id": "RAG.pdf:19:2"}, "page_content": "Nếu mô hình tựtin vềcâu trảlời đó, câu trảlời sẽđược chấp nhận mà không cần truy vấn thêm.", "id": "233"}, {"metadata": {"id": "RAG.pdf:19:3"}, "page_content": "Trong\ntrường hợp mô hình không tựtin, một câu truy vấn sẽđược tạo dựa trên câu tiếp theo đểtìm kiếm\nthông tin cần thiết, và sau đó câu trảlời sẽđược tạo ra lại.", "id": "234"}, {"metadata": {"id": "RAG.pdf:19:4"}, "page_content": "Cách tiếp cận này hiệu quảbởi vì thường\nxuyên từcó độtựtin thấp thì liên quan đến việc thiếu thông tin.", "id": "235"}, {"metadata": {"id": "RAG.pdf:19:5"}, "page_content": "9.2\nSelf RAG: Learning to retrieve, generate, and critique through self-reflection\nhttps://arxiv.org/pdf/2310.11511.pdf https://www.youtube.com/watch?v=i4V9iJcxzZ4\nBài báo \"Self-RAG: Learning to Retrieve, Generate, and Critique through Self-Reflection\" giới thiệu\nmột framework mới có tên là Self-Reflective Retrieval-Augmented Generation (Self-RAG).", "id": "236"}, {"metadata": {"id": "RAG.pdf:19:6"}, "page_content": "Framework\nnày nhằm mục đích cải thiện chất lượng và độchính xác vềthông tin của các mô hình ngôn ngữlớn\n(LLMs) bằng cách cho phép chúng tựđộng tìm kiếm thông tin và phản ánh vềnội dung được trích xuất\ncũng như phản hồi của chính mình.", "id": "237"}, {"metadata": {"id": "RAG.pdf:19:7"}, "page_content": "Khác với các mô hình RAG truyền thống có thểtrích xuất thông\ntin không liên quan, Self-RAG sửdụng các mã token đặc biệt gọi là token phản ánh đểlàm cho mô hình\ncó thểkiểm soát và thích nghi với nhiều nhiệm vụkhác nhau.", "id": "238"}, {"metadata": {"id": "RAG.pdf:19:8"}, "page_content": "Các tác giảchứng minh rằng Self-RAG\nvượt trội hơn các mô hình LLM hiện tại và các mô hình tăng cường tìm kiếm trong các nhiệm vụnhư\nQA miền mở, suy luận, xác minh sựthật và tạo ra văn bản dài, làm nổi bật những cải thiện đáng kể\nvềtính chính xác và độchính xác của trích dẫn.", "id": "239"}, {"metadata": {"id": "RAG.pdf:19:9"}, "page_content": "19\n", "id": "240"}, {"metadata": {"id": "RAG.pdf:20:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nTrong nghiên cứu này, các tác giảhuấn luyện mô hình LLM đểtựsinh ra 4 loại token phải ứng\n(reflection token) đểhỗtrợcho quá trình trảlời, bao gồm:\n• Retrieve: Cho mô hình biết có nên truy vấn/tiếp tục truy vấn hay không. • IsRel: Đánh giá xem kết quảtruy vấn có cung cấp thông tin hữu dụng cho quá trình trảlời câu\nhỏi hay không.", "id": "241"}, {"metadata": {"id": "RAG.pdf:20:1"}, "page_content": "• IsSup: Cho biết mực độkết quảtruy vấn cung cấp dẫn chứng hỗtrợcho câu trả, bao gồm: support\nhoàn toàn, support một phần, và hoàn toàn không support cho câu trảlời.", "id": "242"}, {"metadata": {"id": "RAG.pdf:20:2"}, "page_content": "• IsUse: Đánh giá xem mức độhữu dụng của câu trảlời, trên thang điểm từ1-5.", "id": "243"}, {"metadata": {"id": "RAG.pdf:20:3"}, "page_content": "Ởquá trình inference, thuật toán Self-RAG hoạt động như sau:\n• Đầu tiên ta có một câu hỏi prompt từngười dùng và câu trảlời từbước trước đó (nếu có).", "id": "244"}, {"metadata": {"id": "RAG.pdf:20:4"}, "page_content": "Model\nsẽtựtạo ra token Retrieve đểdựđoán xem có cần truy vấn thông tin từcơ sởdữliệu hay không.", "id": "245"}, {"metadata": {"id": "RAG.pdf:20:5"}, "page_content": "• Nếu cần Retrieve thì:\n– Truy vấn thông tin cần thiết từcơ sởdữliệu.", "id": "246"}, {"metadata": {"id": "RAG.pdf:20:6"}, "page_content": "– Mô hình dựđoán token IsRel đểdựđoán kết quảtruy vấn có cung cấp thông tin cần thiết.", "id": "247"}, {"metadata": {"id": "RAG.pdf:20:7"}, "page_content": "– Mô hình dựđoán token IsSup và IsUse đểđánh giá từng kết quảtruy vấn.", "id": "248"}, {"metadata": {"id": "RAG.pdf:20:8"}, "page_content": "– Rerank lại kết quảtruy vấn dựa trên 3 token IsRel, IsSup và IsUse.", "id": "249"}, {"metadata": {"id": "RAG.pdf:20:9"}, "page_content": "• Nếu không cần Retrieve, mô hình sẽtrảlời mà không cần retrieve, sau đó dựđoán độhữu ích của\ncâu trảlời qua token IsUse.", "id": "250"}, {"metadata": {"id": "RAG.pdf:20:10"}, "page_content": "20\n", "id": "251"}, {"metadata": {"id": "RAG.pdf:21:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\n9.3\nSELF-DISCOVER: Large Language Models Self-Compose Reasoning Struc-\ntures\nhttps://arxiv.org/pdf/2402.03620.pdf 52 y Trong các nghiên cứu, các phương pháp prompting khác\nnhau thường được đềxuất đểgiải quyết một vấn đềhết sức cụthể, chẳng hạn như giải toán, suy luận\ntheo từng bước, hay suy luận sốhọc. Tuy nhiên các phương pháp prompting này lại không thật sự\nphù hợp với tất cảcác task, chẳng hạn những phương pháp prompting chuyên vềgiải toán sẽkhông\ntốt bằng những phương pháp khác khi được ứng dụng trong tác vụtrảlời câu hỏi suy luận logic.", "id": "252"}, {"metadata": {"id": "RAG.pdf:21:1"}, "page_content": "Vì\nvậy nghiên cứu \"SELF-DISCOVER: Large Language Models Self-Compose Reasoning Structures\" Zhou\net al., 2024 nhắm đến tựtìm kiếm những cấu trúc suy luận phù hợp nahast cho từng task, trong khi\nvẫn giữtính hiệu quảvềmặt tính toán.", "id": "253"}, {"metadata": {"id": "RAG.pdf:21:2"}, "page_content": "Phương pháp này được lấy cảm hứng từcách con người chúng ta suy luận một vấn đề.", "id": "254"}, {"metadata": {"id": "RAG.pdf:21:3"}, "page_content": "Phương pháp\nnày được chia thành 2 gai đoạn.", "id": "255"}, {"metadata": {"id": "RAG.pdf:21:4"}, "page_content": "Ởgiai đoạn đầu tiên, phương pháp self-discover sẽtìm ra những cấu\ntrúc prompt suy luận phù hợp nhất cho từng task.", "id": "256"}, {"metadata": {"id": "RAG.pdf:21:5"}, "page_content": "Sau đó các cấu trúc này sẽđược format vềdạng\nJSON, bới cấu trúc này được chứng minh là tăng cường khảnăng suy luận của mô hình Zhou et al.,\n2023.", "id": "257"}, {"metadata": {"id": "RAG.pdf:21:6"}, "page_content": "Bước này có mục tiêu là tìm những cấu trúc suy luận hợp lý nhất cho từng tác vụ, và không chỉ\nmột tác vụtrong một lần.", "id": "258"}, {"metadata": {"id": "RAG.pdf:21:7"}, "page_content": "Ởgiai đoạn thứ2, phương pháp này sửdụng những cấu trúc suy luận ởbước\ntrước và tìm ra cấu trúc phù hợp nhất với mỗi câu hỏi của người dùng.", "id": "259"}, {"metadata": {"id": "RAG.pdf:21:8"}, "page_content": "Giai 1 bao gồm 3 hành động chính:\n• SELECT: Những cấu trúc suy luận có thểcần thiết đểgiải quyết tác vụđược chọn từmột tập\nmô tảcác cấu trúc suy luân.", "id": "260"}, {"metadata": {"id": "RAG.pdf:21:9"}, "page_content": "• ADAPT: Cấu trúc suy luận ởbước trước sẽđược viết lại đểphù hợp hơn với tác vụmà mô hình\nđang muốn giải quyết.", "id": "261"}, {"metadata": {"id": "RAG.pdf:21:10"}, "page_content": "• IMPLEMENT: cấu trúc vừa được tạo ra sẽđược tiến hành thành một cấu trúc từng bước các\nhành động đểgiải quyết tác vụ.", "id": "262"}, {"metadata": {"id": "RAG.pdf:21:11"}, "page_content": "Sau 3 bước ởgiai đoạn 1, ta đã tìm được cấu trúc phù hợp đểgiải 1 tác vụcụthể.", "id": "263"}, {"metadata": {"id": "RAG.pdf:21:12"}, "page_content": "Sau đó ta sẽ\nprompt mô hình ngôn ngữlớn đểlàm theo cấu trúc đó, từđó tạo ra câu trảlời chính xác cho người\ndùng.", "id": "264"}, {"metadata": {"id": "RAG.pdf:21:13"}, "page_content": "9.4\nCorrective RAG\nhttps://arxiv.org/abs/2401.15884 https://www.youtube.com/watch?v=pbAd8O1Lvm4\n21\n", "id": "265"}, {"metadata": {"id": "RAG.pdf:22:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nTrong các ứng dụng RAG thông thường, thông tin ngữcảnh truy vấn sẽđược đưa vào mô hình để\nsinh ra kết quả, bất kết rằng thông tin đó có liên quan hay không.", "id": "266"}, {"metadata": {"id": "RAG.pdf:22:1"}, "page_content": "Điều này làm cho kết quảsinh ra\nbởi mô hình trởnên nhiễu và làm chậm tốc độtạo sinh đi rất nhiều.", "id": "267"}, {"metadata": {"id": "RAG.pdf:22:2"}, "page_content": "Vì vậy nghiên cứu \"Corrective\nRetrieval Augmented Generation\" Yan et al., 2024 được đưa ra nhằm giải quyết vấn đềnày.", "id": "268"}, {"metadata": {"id": "RAG.pdf:22:3"}, "page_content": "Bài báo này\nđi vào nghiên cứu những trường hợp khi những thông tin truy vấn được không liên quan hoặc không\nchính xác, đồng thời đềxuất 1 cơ chếtựđộng điều chỉnh và tối ưu những văn bản truy vấn.", "id": "269"}, {"metadata": {"id": "RAG.pdf:22:4"}, "page_content": "Cụthể, phương pháp này hoạt động như sau.", "id": "270"}, {"metadata": {"id": "RAG.pdf:22:5"}, "page_content": "Cho một câu query và nhiều văn bản được truy vấn.", "id": "271"}, {"metadata": {"id": "RAG.pdf:22:6"}, "page_content": "Một mô hình đánh giá gọn nhẹsẽđược sửdụng đểđánh giá độphù hợp của các văn bản với câu query\nđầu vào, quy thành 3 mức độ: Đúng, Không đúng và không rõ ràng, tương ứng với những hành động\nkhác nhau. Nếu những văn bản truy vấn được là Đúng, những văn bản đó sẽđược chắt lọc lại thành\nnhững thông tin liên quan.", "id": "272"}, {"metadata": {"id": "RAG.pdf:22:7"}, "page_content": "Quá trình này bao gồm: phân rã kiến thức, chắt lọc và sắp xếp lại kiến thức.", "id": "273"}, {"metadata": {"id": "RAG.pdf:22:8"}, "page_content": "Nếu những văn bản truy vấn được là không chính xác, những văn bản này sẽđược bỏđi, thay vào đó\nlà bước tìm kiếm trên internet.", "id": "274"}, {"metadata": {"id": "RAG.pdf:22:9"}, "page_content": "Khi những thông tin truy vấn là không rõ ràng, cả2 quá trình chắt lọc\nvà tìm kiếm trên web sẽđồng thời được diễn ra.", "id": "275"}, {"metadata": {"id": "RAG.pdf:22:10"}, "page_content": "Một trong những thành phần quan trọng nhất trong phương pháp này là mô hình đánh giá văn bản\ntruy vấn.", "id": "276"}, {"metadata": {"id": "RAG.pdf:22:11"}, "page_content": "Trong nghiên cứu này, mô hình T5-Large được sửdụng đểfine-tune cho tác vụnày.", "id": "277"}, {"metadata": {"id": "RAG.pdf:22:12"}, "page_content": "Với mỗi\ncâu query, sẽcó 10 văn bản được truy vấn.", "id": "278"}, {"metadata": {"id": "RAG.pdf:22:13"}, "page_content": "Từng câu sẽkết hợp với câu query đểthành input đầu vào\nđưa vào mô hình T5, từđó đưa ra một thang điểm độliên quan.", "id": "279"}, {"metadata": {"id": "RAG.pdf:22:14"}, "page_content": "Dựa trên thang điểm này, ta sẽphân\nloại văn bản đầu vào thành 3 loại: Đúng, Không Đúng, hoặc không liên quan.", "id": "280"}, {"metadata": {"id": "RAG.pdf:22:15"}, "page_content": "Khi những văn bản truy vấn được là Đúng, quá trình chắt lọc kiến thức sẽđược bắt đầu.", "id": "281"}, {"metadata": {"id": "RAG.pdf:22:16"}, "page_content": "Đầu tiên,\nnhững văn bản này sẽđược cắt ra thành những đoạn kiến thức.", "id": "282"}, {"metadata": {"id": "RAG.pdf:22:17"}, "page_content": "Lúc này mô hình đánh giá truy vấn ở\nbước trên sẽđược sửdụng lại độliên quan của những dải kiến thức này, và những dải không quá liên\n22\n", "id": "283"}, {"metadata": {"id": "RAG.pdf:23:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nquan sẽđược loại bỏđi, trong khi những dải có liên quan sẽđược giữlại.", "id": "284"}, {"metadata": {"id": "RAG.pdf:23:1"}, "page_content": "Khi những văn bản truy vấn là Không Đúng, quá trình tìm kiếm trên web sẽđược bắt đầu.", "id": "285"}, {"metadata": {"id": "RAG.pdf:23:2"}, "page_content": "Cụthể\ncâu đầu vào sẽđược viết lại thành những keyword đểmô phỏng quá trình tìm kiếm trên web.", "id": "286"}, {"metadata": {"id": "RAG.pdf:23:3"}, "page_content": "Sau đó\nquá trình chắt lọc thông tin tương tựnhư bước trên sẽđược sửdụng đểđưa ra những dải kiến thức\nliên quan nhất.", "id": "287"}, {"metadata": {"id": "RAG.pdf:23:4"}, "page_content": "9.5\nWikiChat\nhttps://arxiv.org/pdf/2305.14292v2.pdf Đây là một phương pháp được nghiên cứu trong paper \"Wi-\nkiChat: Stopping the Hallucination of Large Language Model Chatbots by Few-Shot Grounding on\nWikipedia\" Semnani et al., 2023, nhằm giải quyết vấn đền câu trảlời đưa ra bởi mô hình ngôn ngữlớn\ncó độtrung thực không cao và có tỉlệtưởng tượng (hallucination) lớn. Phương pháp này bao gồm 7\nbước chính, với mỗi bước sửdụng few-shot prompting đểhướng mô hình trảlời theo ý muốn của người\ndùng.", "id": "288"}, {"metadata": {"id": "RAG.pdf:23:5"}, "page_content": "Nhìn tổng quan, WikiChat bao gồm 2 giai đoạn chính, giai đoạn đầu là thu thập thông tin dựa\ntrên đoạn chat với người dùng, và giai đoạn hai đưa ra câu trảlời dựa trên thông tin thu thập được.", "id": "289"}, {"metadata": {"id": "RAG.pdf:23:6"}, "page_content": "5\nbước đầu của phương pháp này thuộc vềgiai đoạn 1, và 2 bước sau thuộc vềgiai đoạn 2, sau đây chúng\nta đi chi tiết từng giai đoạn.", "id": "290"}, {"metadata": {"id": "RAG.pdf:23:7"}, "page_content": "Giai đoạn 1: Thu thập thông tin Trong quá trình giao tiếp với người dùng, WikiChat sẽtự\nnhận biết lúc nào nên thu thập thông tin, (khi người dùng đưa ra câu hỏi trực tiếp).", "id": "291"}, {"metadata": {"id": "RAG.pdf:23:8"}, "page_content": "Giai đoạn này bao\ngồm 5 bước chính\n• Bước 1: WikiChat sẽtựtạo một câu query có thểbao hàm được ý muốn của người dùng, cộng thêm\nmột mốc thời gian chẳng hạn như \"recent\" nếu câu trảlời cần cập nhật nhất có thể, \"year=xxxx\"\ncho một năm cụthể, hoặc là none nếu thời gian là không quan trọng.", "id": "292"}, {"metadata": {"id": "RAG.pdf:23:9"}, "page_content": "• Bước 2: WikiChat trích xuất những thông tin liên quan từnhững văn bản truy vấn được thành\ndạng những gạch đầu dòng tóm tắt, và những thông tin không liên quan sẽđược lọc đi.", "id": "293"}, {"metadata": {"id": "RAG.pdf:23:10"}, "page_content": "• Bước 3: Mô hình LLM sẽđược sửdụng đểtạo ra câu trảlời, câu trảlời này thường sẽđềcập\nnhững thông tin liên quan và thú vị, tuy nhiên thường không đáng tin cậy.", "id": "294"}, {"metadata": {"id": "RAG.pdf:23:11"}, "page_content": "• Bước 4: Câu trảlời của mô hình sẽđược chia nhỏra thành từng câu khẳng định một.", "id": "295"}, {"metadata": {"id": "RAG.pdf:23:12"}, "page_content": "Sau đó một\nhệthống truy vấn thông tin sẽđược sửdụng đểtruy vấn những bằng chứng cho khẳng định đó.", "id": "296"}, {"metadata": {"id": "RAG.pdf:23:13"}, "page_content": "• Bước 5: Sửdụng một mô hình LLM khác, từng câu khẳng định sẽđược chia thành 3 nhóm chính,\nnhững bằng chứng truy vấn được ủng hộkhẳng định, phủđịnh, hoặc không đủthông tin đểkết\nluận.", "id": "297"}, {"metadata": {"id": "RAG.pdf:23:14"}, "page_content": "Chỉnhững khẳng định được ủng hộbởi bằng chứng mới được giữlại.", "id": "298"}, {"metadata": {"id": "RAG.pdf:23:15"}, "page_content": "23\n", "id": "299"}, {"metadata": {"id": "RAG.pdf:24:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nGiai đoạn 2: Tạo ra câu trảlời Bước tiếp theo là dùng những thông tin đã thu thập được tạo ra\ncâu trảlời chính xác. Nghiên cứu này chỉra rằng việc trực tiếp tạo ra câu trảlời sẽgây khó khăn trong\nviệc duy trì tính hội thoại cho câu trảlời của mô hình.", "id": "300"}, {"metadata": {"id": "RAG.pdf:24:1"}, "page_content": "Vì vậy, giai đoạn này sẽchia thành 2 bước nhỏ.", "id": "301"}, {"metadata": {"id": "RAG.pdf:24:2"}, "page_content": "• Bước 6: WikiChat tạo ra một câu trảlời tạm dựa trên những gạch đầu dòng được truy vấn từ\nbước trước.", "id": "302"}, {"metadata": {"id": "RAG.pdf:24:3"}, "page_content": "• Bước 7: Sau đó WikiChat sẽtạo ra nhận xét và chỉnh sửa lại câu trảlời dựa trên các yếu tốtính\nphù hợp, tính tựnhiên, tính không lặp lại và tính đúng đắn vềmặt thời gian.", "id": "303"}, {"metadata": {"id": "RAG.pdf:24:4"}, "page_content": "Chắt lọc kiến thức sáng các mô hình nhỏhơn Đểgiảm độtrễ, chi phí và đảm bảo tính riêng\ntư, nghiên cứu này đểxuất phương pháp đểchắt lọc kiến thức từmột mô hình lớn và mã nguồn đóng\n(chẳng hạn như GPT-4) sang một mô hình nhỏhơn và mã nguồn mở(chẳng hạn như Llama-7B).", "id": "304"}, {"metadata": {"id": "RAG.pdf:24:5"}, "page_content": "Một\nmô hình ngôn ngữgiảlập người dùng sẽđược sửdụng đểhội thọai với WikiChat vềnhững chủđề\nđược lấy từWikipedia, và ghi lại những đầu vào và đầu ra của mô hình.", "id": "305"}, {"metadata": {"id": "RAG.pdf:24:6"}, "page_content": "Dữliệu này sẽđược giữlại để\nfine-tune mô hình Llama nhỏ.", "id": "306"}, {"metadata": {"id": "RAG.pdf:24:7"}, "page_content": "Kết quảthu được cho thấy mô hình nhỏnày có khảnăng trảlời tiệm\ncận so với mô hình lớn, trong khi giảm đi độtrễ, chi phí và vẫn đảm bảo được tính riêng tư cho dữliệu\nngười dùng.", "id": "307"}, {"metadata": {"id": "RAG.pdf:24:8"}, "page_content": "References\nLewis, P., Perez, E., Piktus, A., Petroni, F., Karpukhin, V., Goyal, N., K¨uttler, H., Lewis, M., tau\nYih, W., Rockt¨aschel, T., Riedel, S., & Kiela, D.", "id": "308"}, {"metadata": {"id": "RAG.pdf:24:9"}, "page_content": "(2021).", "id": "309"}, {"metadata": {"id": "RAG.pdf:24:10"}, "page_content": "Retrieval-augmented generation for\nknowledge-intensive nlp tasks.", "id": "310"}, {"metadata": {"id": "RAG.pdf:24:11"}, "page_content": "Gao, Y., Xiong, Y., Gao, X., Jia, K., Pan, J., Bi, Y., Dai, Y., Sun, J., Guo, Q., Wang, M., & Wang, H.", "id": "311"}, {"metadata": {"id": "RAG.pdf:24:12"}, "page_content": "(2024).", "id": "312"}, {"metadata": {"id": "RAG.pdf:24:13"}, "page_content": "Retrieval-augmented generation for large language models: A survey.", "id": "313"}, {"metadata": {"id": "RAG.pdf:24:14"}, "page_content": "Gao, L., Ma, X., Lin, J., & Callan, J.", "id": "314"}, {"metadata": {"id": "RAG.pdf:24:15"}, "page_content": "(2022).", "id": "315"}, {"metadata": {"id": "RAG.pdf:24:16"}, "page_content": "Precise zero-shot dense retrieval without relevance labels.", "id": "316"}, {"metadata": {"id": "RAG.pdf:24:17"}, "page_content": "Liu, N.", "id": "317"}, {"metadata": {"id": "RAG.pdf:24:18"}, "page_content": "F., Lin, K., Hewitt, J., Paranjape, A., Bevilacqua, M., Petroni, F., & Liang, P.", "id": "318"}, {"metadata": {"id": "RAG.pdf:24:19"}, "page_content": "(2023).", "id": "319"}, {"metadata": {"id": "RAG.pdf:24:20"}, "page_content": "Lost in\nthe middle: How language models use long contexts.", "id": "320"}, {"metadata": {"id": "RAG.pdf:24:21"}, "page_content": "24\n", "id": "321"}, {"metadata": {"id": "RAG.pdf:25:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nKamradt, G.", "id": "322"}, {"metadata": {"id": "RAG.pdf:25:1"}, "page_content": "(2024).", "id": "323"}, {"metadata": {"id": "RAG.pdf:25:2"}, "page_content": "The 5 levels of text splitting for retrieval.", "id": "324"}, {"metadata": {"id": "RAG.pdf:25:3"}, "page_content": "https://youtu.be/8OJC21T2SL4\nChen, T., Wang, H., Chen, S., Yu, W., Ma, K., Zhao, X., Zhang, H., & Yu, D.", "id": "325"}, {"metadata": {"id": "RAG.pdf:25:4"}, "page_content": "(2023).", "id": "326"}, {"metadata": {"id": "RAG.pdf:25:5"}, "page_content": "Dense x retrieval:\nWhat retrieval granularity should we use?", "id": "327"}, {"metadata": {"id": "RAG.pdf:25:6"}, "page_content": "Wang, Z., Zhang, H., Li, C.-L., Eisenschlos, J.", "id": "328"}, {"metadata": {"id": "RAG.pdf:25:7"}, "page_content": "M., Perot, V., Wang, Z., Miculicich, L., Fujii, Y., Shang,\nJ., Lee, C.-Y., & Pfister, T.", "id": "329"}, {"metadata": {"id": "RAG.pdf:25:8"}, "page_content": "(2024).", "id": "330"}, {"metadata": {"id": "RAG.pdf:25:9"}, "page_content": "Chain-of-table: Evolving tables in the reasoning chain for\ntable understanding. Muennighoff, N., Tazi, N., Magne, L., & Reimers, N.", "id": "331"}, {"metadata": {"id": "RAG.pdf:25:10"}, "page_content": "(2023).", "id": "332"}, {"metadata": {"id": "RAG.pdf:25:11"}, "page_content": "Mteb: Massive text embedding benchmark.", "id": "333"}, {"metadata": {"id": "RAG.pdf:25:12"}, "page_content": "Kojima, T., Gu, S.", "id": "334"}, {"metadata": {"id": "RAG.pdf:25:13"}, "page_content": "S., Reid, M., Matsuo, Y., & Iwasawa, Y.", "id": "335"}, {"metadata": {"id": "RAG.pdf:25:14"}, "page_content": "(2023).", "id": "336"}, {"metadata": {"id": "RAG.pdf:25:15"}, "page_content": "Large language models are zero-shot\nreasoners.", "id": "337"}, {"metadata": {"id": "RAG.pdf:25:16"}, "page_content": "Jiang, Z., Xu, F.", "id": "338"}, {"metadata": {"id": "RAG.pdf:25:17"}, "page_content": "F., Gao, L., Sun, Z., Liu, Q., Dwivedi-Yu, J., Yang, Y., Callan, J., & Neubig, G.", "id": "339"}, {"metadata": {"id": "RAG.pdf:25:18"}, "page_content": "(2023).", "id": "340"}, {"metadata": {"id": "RAG.pdf:25:19"}, "page_content": "Active retrieval augmented generation.", "id": "341"}, {"metadata": {"id": "RAG.pdf:25:20"}, "page_content": "Schick, T., Dwivedi-Yu, J., Dessi, R., Raileanu, R., Lomeli, M., Zettlemoyer, L., Cancedda, N., &\nScialom, T.", "id": "342"}, {"metadata": {"id": "RAG.pdf:25:21"}, "page_content": "Toolformer: Language models can teach themselves to use tools.", "id": "343"}, {"metadata": {"id": "RAG.pdf:25:22"}, "page_content": "In: 2023.", "id": "344"}, {"metadata": {"id": "RAG.pdf:25:23"}, "page_content": "Zhou, P., Pujara, J., Ren, X., Chen, X., Cheng, H.-T., Le, Q.", "id": "345"}, {"metadata": {"id": "RAG.pdf:25:24"}, "page_content": "V., Chi, E.", "id": "346"}, {"metadata": {"id": "RAG.pdf:25:25"}, "page_content": "H., Zhou, D., Mishra, S., &\nZheng, H.", "id": "347"}, {"metadata": {"id": "RAG.pdf:25:26"}, "page_content": "S.", "id": "348"}, {"metadata": {"id": "RAG.pdf:25:27"}, "page_content": "(2024).", "id": "349"}, {"metadata": {"id": "RAG.pdf:25:28"}, "page_content": "Self-discover: Large language models self-compose reasoning structures.", "id": "350"}, {"metadata": {"id": "RAG.pdf:25:29"}, "page_content": "Zhou, Y., Muresanu, A.", "id": "351"}, {"metadata": {"id": "RAG.pdf:25:30"}, "page_content": "I., Han, Z., Paster, K., Pitis, S., Chan, H., & Ba, J.", "id": "352"}, {"metadata": {"id": "RAG.pdf:25:31"}, "page_content": "(2023).", "id": "353"}, {"metadata": {"id": "RAG.pdf:25:32"}, "page_content": "Large language\nmodels are human-level prompt engineers.", "id": "354"}, {"metadata": {"id": "RAG.pdf:25:33"}, "page_content": "Yan, S.-Q., Gu, J.-C., Zhu, Y., & Ling, Z.-H.", "id": "355"}, {"metadata": {"id": "RAG.pdf:25:34"}, "page_content": "(2024).", "id": "356"}, {"metadata": {"id": "RAG.pdf:25:35"}, "page_content": "Corrective retrieval augmented generation.", "id": "357"}, {"metadata": {"id": "RAG.pdf:25:36"}, "page_content": "Semnani, S.", "id": "358"}, {"metadata": {"id": "RAG.pdf:25:37"}, "page_content": "J., Yao, V.", "id": "359"}, {"metadata": {"id": "RAG.pdf:25:38"}, "page_content": "Z., Zhang, H.", "id": "360"}, {"metadata": {"id": "RAG.pdf:25:39"}, "page_content": "C., & Lam, M.", "id": "361"}, {"metadata": {"id": "RAG.pdf:25:40"}, "page_content": "S.", "id": "362"}, {"metadata": {"id": "RAG.pdf:25:41"}, "page_content": "(2023).", "id": "363"}, {"metadata": {"id": "RAG.pdf:25:42"}, "page_content": "Wikichat: Stopping the hallucination\nof large language model chatbots by few-shot grounding on wikipedia.", "id": "364"}, {"metadata": {"id": "RAG.pdf:25:43"}, "page_content": "- Hết -\n25\n", "id": "365"}, {"metadata": {"id": "Mamba for Vision.pdf:1:0"}, "page_content": "AI VIET NAM – AIO Course\nMamba for Vision\nMinh-Duc Bui và Quang-Vinh Dinh\nPR-Team: Đăng-Nhã Nguyễn, Minh-Châu Phạm và Hoàng-Nguyên Vũ\nNgày 23 tháng 2 năm 2024\n1\nIntroduction\nMamba, tên gọi khác là S6 (Structured State Space for Sequence Modeling with Selective Scan), là\nmột kiến trúc mới xuất hiện gần đây. Điểm khác biệt chính giữa Mamba và các mô hình hiện tại như\nTransformer là Mamba không sửdụng cơ chếattention.", "id": "366"}, {"metadata": {"id": "Mamba for Vision.pdf:1:1"}, "page_content": "Nhờvậy, Mamba có độphức tạp thấp hơn\nnhiều so với Transformer, chỉO(n) so với O(n2) của Transformer (với n là chiều dài sequence).", "id": "367"}, {"metadata": {"id": "Mamba for Vision.pdf:1:2"}, "page_content": "Bên\ncạnh đó, Mamba cho độchính xác cao khi chiều dài sequence tăng (lên đến hàng triệu).", "id": "368"}, {"metadata": {"id": "Mamba for Vision.pdf:1:3"}, "page_content": "Trong bài viết này, ta sẽtìm hiểu cách các nhà nghiên cứu đã áp dụng kiến trúc Mamba vào data dạng\nảnh, thông qua các bài paper sau:\n1\n", "id": "369"}, {"metadata": {"id": "Mamba for Vision.pdf:2:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nTitle\nLink\nGithub\nVision Mamba: Efficient Visual Representation Learning with Bidirectional State\nSpace Model\nhere\nhere\nVMamba: Visual State Space Model\nhere\nhere\nU-Mamba: Enhancing Long-range Dependency for Biomedical Image Segmentation\nhere\nhere\nSwin-UMamba: Mamba-based UNet with ImageNet-based pretraining\nhere\nhere\n2\nText vs.", "id": "370"}, {"metadata": {"id": "Mamba for Vision.pdf:2:1"}, "page_content": "Image\nĐiểm khác biệt chính giữa text và image chính là thông tin vềdimension, text chỉcó 1D trong khi image\nlà 2D.", "id": "371"}, {"metadata": {"id": "Mamba for Vision.pdf:2:2"}, "page_content": "Điều này gây ra khó khăn khi áp dụng các model từNLP (ví dụMamba, Transformer) sang CV.", "id": "372"}, {"metadata": {"id": "Mamba for Vision.pdf:2:3"}, "page_content": "Hình 1: Pixel-level và Patch-level khi sửdụng mô hình Transformer cho data dạng ảnh.", "id": "373"}, {"metadata": {"id": "Mamba for Vision.pdf:2:4"}, "page_content": "Hình 1 mô tả2 cách chuyển đổi từdata 2D sang data 1D.", "id": "374"}, {"metadata": {"id": "Mamba for Vision.pdf:2:5"}, "page_content": "Nếu ta chia ảnh đầu vào theo pixel-level\nthì với ví dụnhư hình (ảnh 224x224) ta sẽcó hơn 50k token, nếu ánh xạtương ứng sang text là 1 câu\ncó 50k từ.", "id": "375"}, {"metadata": {"id": "Mamba for Vision.pdf:2:6"}, "page_content": "Điều này cực kì khó khăn đối với các GPU đểtính toán.", "id": "376"}, {"metadata": {"id": "Mamba for Vision.pdf:2:7"}, "page_content": "Cách phổbiến được sửdụng đối\nvới Transformer chính là chia ảnh đầu vào thành các patch nhỏ(ví dụ16x16 pixel), ảnh có kích thước\n224x224 sau khi chia sẽcó tổng cộng 14*14=196 patch (hoặc token). 196 token là hoàn toàn hợp lý so với\n50k và các GPU vẫn có thểhoạt động bình thường.", "id": "377"}, {"metadata": {"id": "Mamba for Vision.pdf:2:8"}, "page_content": "2\n", "id": "378"}, {"metadata": {"id": "Mamba for Vision.pdf:3:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\n3\nVision Mamba\nVision Mamba (Vim) là bài paper đầu tiên áp dụng Mamba vào data dạng ảnh. Các tác giảđã thay\nthếTransformer Encoder trong Vision Transformer (ViT) bằng Vision Mamba Encoder, và thay\nđổi kiến trúc SSM thành Bidirectional SSM (tương tựBidirectional LSTM).", "id": "379"}, {"metadata": {"id": "Mamba for Vision.pdf:3:1"}, "page_content": "Kiến trúc của Vim và\nVision Mamba Encoder được mô tảnhư hình 2.", "id": "380"}, {"metadata": {"id": "Mamba for Vision.pdf:3:2"}, "page_content": "Từng Vision Mamba Encoder block sẽcó 2 block SSM là\nForward SSM và Backward SSM.", "id": "381"}, {"metadata": {"id": "Mamba for Vision.pdf:3:3"}, "page_content": "Giảsửta đánh sốcác token theo thứtựtừ1 đến N, thì Forward\nSSM sẽtính SSM theo chiều thuận từ1 đến N, Backward SSM sẽtính theo chiều ngược lại từN đến\n1.", "id": "382"}, {"metadata": {"id": "Mamba for Vision.pdf:3:4"}, "page_content": "Tương tựtrong data dạng text, Forward là từđầu câu đến cuối câu, và Backward là từcuối câu đến\nđầu câu.", "id": "383"}, {"metadata": {"id": "Mamba for Vision.pdf:3:5"}, "page_content": "Việc tính toán như vậy giúp model học được thông tin từ2 hướng khác nhau.", "id": "384"}, {"metadata": {"id": "Mamba for Vision.pdf:3:6"}, "page_content": "Hình 2: Kiến trúc Vision Mamba (Vim) và Vision Mamba Encoder.", "id": "385"}, {"metadata": {"id": "Mamba for Vision.pdf:3:7"}, "page_content": "Hình 3 mô tảkết quảgiữa Transformer (DeiT) và Vision Mamba (Vim).", "id": "386"}, {"metadata": {"id": "Mamba for Vision.pdf:3:8"}, "page_content": "Ta thấy, Vim vượt trội hơn\nDeiT ởtất cảcác task bao gồm: image classification, object detection, và instance segmentation.", "id": "387"}, {"metadata": {"id": "Mamba for Vision.pdf:3:9"}, "page_content": "Hơn\nnữa, khi kích thước ảnh đầu vào tăng, Vim outperform DeiT ởcảspeed và memory.", "id": "388"}, {"metadata": {"id": "Mamba for Vision.pdf:3:10"}, "page_content": "Cụthể, Vim nhanh\nhơn và tiết kiệm bộnhớhơn DeiT lần lượt là 2.8x và 86.8%.", "id": "389"}, {"metadata": {"id": "Mamba for Vision.pdf:3:11"}, "page_content": "Khi công nghệngày càng phát triển, kích\nthước ảnh 224x224 -> 512x512 dần trởnên lỗi thời, con người luôn muốn sửdụng ảnh có kích thước lớn\nhơn đểcác model có thểđạt độchính xác cao hơn.", "id": "390"}, {"metadata": {"id": "Mamba for Vision.pdf:3:12"}, "page_content": "Điều này càng chứng tỏMamba sẽcó khảnăng cao\ntrởthành backbone được sửdụng trong tương lai.", "id": "391"}, {"metadata": {"id": "Mamba for Vision.pdf:3:13"}, "page_content": "Hình 3: Kết quảso sánh giữa Transformer (DeiT) và Vision Mamba.", "id": "392"}, {"metadata": {"id": "Mamba for Vision.pdf:3:14"}, "page_content": "3\n", "id": "393"}, {"metadata": {"id": "Mamba for Vision.pdf:4:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\n4\nVisual Mamba\nSau khi Vim được công bốchỉ1 ngày thì ta tiếp tục có bài paper thứ2 sửdụng Mamba vào data dạng\nảnh mang tên Visual Mamba (VMamba).", "id": "394"}, {"metadata": {"id": "Mamba for Vision.pdf:4:1"}, "page_content": "Xuất phát từSwin Transformer (một model cải tiến của ViT)\ncác tác giảđã thay thếTransformer block bằng Visual State Space (VSS) block (hình 4).", "id": "395"}, {"metadata": {"id": "Mamba for Vision.pdf:4:2"}, "page_content": "Hình 4: Kiến trúc VMamba và VSS Block.", "id": "396"}, {"metadata": {"id": "Mamba for Vision.pdf:4:3"}, "page_content": "Khác với Vim sửdụng Bidirectional, VMamba sửdụng Four-Directional (4 hướng) đểtính SSM và sử\ndụng tên gọi Cross-Scan.", "id": "397"}, {"metadata": {"id": "Mamba for Vision.pdf:4:4"}, "page_content": "4 hướng này bao gồm:\n1.", "id": "398"}, {"metadata": {"id": "Mamba for Vision.pdf:4:5"}, "page_content": "trái->phải->trên->dưới\n2.", "id": "399"}, {"metadata": {"id": "Mamba for Vision.pdf:4:6"}, "page_content": "phải->trái->dưới->trên\n3.", "id": "400"}, {"metadata": {"id": "Mamba for Vision.pdf:4:7"}, "page_content": "trên->dưới->trái->phải\n4.", "id": "401"}, {"metadata": {"id": "Mamba for Vision.pdf:4:8"}, "page_content": "dưới->trên->phải->trái\nHình 5: So sánh giữa Attention (hình a) và Cross-Scan (hình b). 4\n", "id": "402"}, {"metadata": {"id": "Mamba for Vision.pdf:5:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 5 mô tảcách hoạt động của Cross-Scan, và hình 6 mô tảcách tính toán với Cross-Scan trong SSM\nblock. Cross-Scan giúp VMamba đạt được độphức tạp linear O(n) mà không bịmất bất kỳthông tin\nglobal nào.", "id": "403"}, {"metadata": {"id": "Mamba for Vision.pdf:5:1"}, "page_content": "Ví dụ, token ởvịtrí chính giữa trong hình 5 được tổng hợp thông tin từtất cảcác token\nkhác theo nhiều hướng khác nhau.", "id": "404"}, {"metadata": {"id": "Mamba for Vision.pdf:5:2"}, "page_content": "Cross-Scan được tính toán thông qua 3 bước chính:\n1.", "id": "405"}, {"metadata": {"id": "Mamba for Vision.pdf:5:3"}, "page_content": "Scan expand: các token đầu vào được chia thành 4 sequence khác nhau (theo 4 hướng).", "id": "406"}, {"metadata": {"id": "Mamba for Vision.pdf:5:4"}, "page_content": "2.", "id": "407"}, {"metadata": {"id": "Mamba for Vision.pdf:5:5"}, "page_content": "S6 block: 4 sequence được đưa vào S6 block đểtính toán.", "id": "408"}, {"metadata": {"id": "Mamba for Vision.pdf:5:6"}, "page_content": "3.", "id": "409"}, {"metadata": {"id": "Mamba for Vision.pdf:5:7"}, "page_content": "Scan merge: cuối cùng, 4 sequence sẽđược tổng hợp lại đểtiếp tục expand ởblock tiếp theo.", "id": "410"}, {"metadata": {"id": "Mamba for Vision.pdf:5:8"}, "page_content": "Hình 6: Cách tính toán với Cross-Scan.", "id": "411"}, {"metadata": {"id": "Mamba for Vision.pdf:5:9"}, "page_content": "Hình 7 so sánh kết quảgiữa VMamba và các model Transformer, CNN khác.", "id": "412"}, {"metadata": {"id": "Mamba for Vision.pdf:5:10"}, "page_content": "Ta thấy VMamba là model\nsởhữu cả3 tính chất là:\n• Độphức tạp O(n) (Linear Complexity).", "id": "413"}, {"metadata": {"id": "Mamba for Vision.pdf:5:11"}, "page_content": "• Tổng hợp thông tin global (Global ERF).", "id": "414"}, {"metadata": {"id": "Mamba for Vision.pdf:5:12"}, "page_content": "• Tạo ra param phụthuộc vào input (Dynamic weights).", "id": "415"}, {"metadata": {"id": "Mamba for Vision.pdf:5:13"}, "page_content": "Hình 7: So sánh VMamba và các model Transformer, CNN khác.", "id": "416"}, {"metadata": {"id": "Mamba for Vision.pdf:5:14"}, "page_content": "5\n", "id": "417"}, {"metadata": {"id": "Mamba for Vision.pdf:6:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nTương tựVim, các tác giảcủa VMamba cũng đánh giá backbone Mamba dưới nhiều size ảnh khác\nnhau (tham khảo hình 8). Ta thấy, VMamba vượt trội hơn hầu hết các model khác khi kích thước ảnh\ntăng dần.", "id": "418"}, {"metadata": {"id": "Mamba for Vision.pdf:6:1"}, "page_content": "Hình 8: So sánh VMamba và các model Transformer và CNN khác dưới nhiều size ảnh khác nhau.", "id": "419"}, {"metadata": {"id": "Mamba for Vision.pdf:6:2"}, "page_content": "6\n", "id": "420"}, {"metadata": {"id": "Mamba for Vision.pdf:7:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\n5\nU-Mamba\nHơn 1 tháng sau khi Mamba được công bố, các tác giảtại Đại học Toronto, Canada đã hưởng ứng trend\nnày với bài paper: “U-Mamba: Enhancing Long-range Dependency for Biomedical Image Segmentation”,\nmột bài paper vềbài toán Segmentation trong lĩnh vực Y Sinh. U-Mamba là model theo hướng encoder-\ndecoder tương tựU-Net, nhưng các block nhỏtrong encoder và decoder được thay bằng CNN và SSM\nblock (các tác giảgọi là U-Mamba block).", "id": "421"}, {"metadata": {"id": "Mamba for Vision.pdf:7:1"}, "page_content": "Kiến trúc U-Mamba block và U-Mamba hoàn chỉnh được mô\ntảnhư hình 9.", "id": "422"}, {"metadata": {"id": "Mamba for Vision.pdf:7:2"}, "page_content": "Hình 9: Kiến trúc U-Mamba block và model U-Mamba hoàn chỉnh.", "id": "423"}, {"metadata": {"id": "Mamba for Vision.pdf:7:3"}, "page_content": "Sựkết hợp giữa CNN và SSM tạo nên hybrid CNN-SSM model, model hybrid này vừa có khảnăng\ntổng hợp thông tin local nhờvào CNN và thông tin global nhờvào SSM.", "id": "424"}, {"metadata": {"id": "Mamba for Vision.pdf:7:4"}, "page_content": "Từđó giúp model tổng hợp\nđược 2 khía cạnh khác nhau trong ảnh đầu vào.", "id": "425"}, {"metadata": {"id": "Mamba for Vision.pdf:7:5"}, "page_content": "U-Mamba block hoạt động bằng cách đưa input đầu vào sang CNN block, sau đó output từCNN block\nnày sẽđược đưa vào SSM block.", "id": "426"}, {"metadata": {"id": "Mamba for Vision.pdf:7:6"}, "page_content": "Tùy thuộc vào CNN block thuộc phần encoder hay decoder thì sẽđược\nthiết kếkhác nhau.", "id": "427"}, {"metadata": {"id": "Mamba for Vision.pdf:7:7"}, "page_content": "Đối với encoder, CNN block sẽcó tác dụng giảm kích thước feature map và tăng\nchiều sâu, ngược lại đối với decoder, CNN làm nhiệm vụtăng kích thước feature map và giảm chiều sâu.", "id": "428"}, {"metadata": {"id": "Mamba for Vision.pdf:7:8"}, "page_content": "Bàn luận vềhybrid model: Các model CNN thuần túy (AlexNet, Resnet, VGG,...) là những model\nchỉdùng CNN đểtrích xuất thông tin, nói cách khác chỉtổng hợp được thông tin local.", "id": "429"}, {"metadata": {"id": "Mamba for Vision.pdf:7:9"}, "page_content": "Ngược lại, các\nmodel Transformer (ViT) chỉtrích xuất thông tin global.", "id": "430"}, {"metadata": {"id": "Mamba for Vision.pdf:7:10"}, "page_content": "Và Transformer cho performance vượt trội\nhơn CNN.", "id": "431"}, {"metadata": {"id": "Mamba for Vision.pdf:7:11"}, "page_content": "Nhưng không vì thếmà ta khẳng định rằng thông tin global luôn luôn tốt hơn local, dẫn tới\ntình huống chỉtập trung vào global.", "id": "432"}, {"metadata": {"id": "Mamba for Vision.pdf:7:12"}, "page_content": "Đây là một hiểu lầm phổbiến, cảthông tin local và global đều\ncó những tính chất khác nhau, model mang cả2 thông tin này sẽcho performance cao hơn model chỉ\nmang 1 trong 2.", "id": "433"}, {"metadata": {"id": "Mamba for Vision.pdf:7:13"}, "page_content": "Ví dụmột sốpaper vềTransformer sửdụng thông tin hybrid:\n7\n", "id": "434"}, {"metadata": {"id": "Mamba for Vision.pdf:8:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\n• Neighborhood Attention Transformer\n• Dilated Neighborhood Attention Transformer\n• MaxViT: Multi-Axis Vision Transformer\nHình 10 mô tảkết quảso sánh giữa U-Mamba và các model CNN, Transformer khác. Ta thấy U-Mamba\nvượt trội hoàn toàn so với các model này, khoảng cách rất lớn ≈10%.", "id": "435"}, {"metadata": {"id": "Mamba for Vision.pdf:8:1"}, "page_content": "Hình 10: Bảng so sánh kết quảU-Mamba và các model khác trên dataset ảnh 2D.", "id": "436"}, {"metadata": {"id": "Mamba for Vision.pdf:8:2"}, "page_content": "8\n", "id": "437"}, {"metadata": {"id": "Mamba for Vision.pdf:9:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\n6\nSwin-UMamba\nNgay sau khi U-Mamba được công bốđược chưa đầy 1 tháng thì các tác giảtại Chinese Academy of\nSciences, Peng Cheng Laboratory, và một sốphòng Lab khác đã tiếp tục cải tiến U-Mamba và công\nbốSwin-UMamba. Swin-UMamba là sựkết hợp giữa việc tận dụng pretrained model (VMamba ởphần\n2) và kết hợp với kiến trức U-Net đểgiải quyết bài toán Medical image segmentation.", "id": "438"}, {"metadata": {"id": "Mamba for Vision.pdf:9:1"}, "page_content": "Kiến trúc\nSwin-UMamba được mô tảnhư hình 11.", "id": "439"}, {"metadata": {"id": "Mamba for Vision.pdf:9:2"}, "page_content": "Hình 11: Kiến trúc Swin-UMamba.", "id": "440"}, {"metadata": {"id": "Mamba for Vision.pdf:9:3"}, "page_content": "Nhìn vào hình 11 ta thấy phần Encoder được sửdụng theo kiến trúc Swin Transformer với các Visual\nState Space (VSS) block tương tựbài paper Visual Mamba (VMamba).", "id": "441"}, {"metadata": {"id": "Mamba for Vision.pdf:9:4"}, "page_content": "Chính vì tận dụng kiến trúc\nEncoder như VMamba như thế, ta có thểtận dụng pretrained VMamba đểkhởi tạo.", "id": "442"}, {"metadata": {"id": "Mamba for Vision.pdf:9:5"}, "page_content": "Đối với phần\nDecoder, các tác giảđã thiết kếđơn giản như những model U-Net truyền thống: Transpose Convolution\n+ Skip-Connection.", "id": "443"}, {"metadata": {"id": "Mamba for Vision.pdf:9:6"}, "page_content": "Hình 12 mô tảkết quảcủa Swin-UMamba và các model Transformer-, Mamba-based khác.", "id": "444"}, {"metadata": {"id": "Mamba for Vision.pdf:9:7"}, "page_content": "Ta thấy khi\nsửdụng pretrained model từVMamba thì performance đã tăng từ4->6%.", "id": "445"}, {"metadata": {"id": "Mamba for Vision.pdf:9:8"}, "page_content": "Swin-UMamba dù sửdụng\nít sốlượng parameter hơn so với U-Mamba ≈30->40\\% nhưng vẫn cho kết quảcao hơn.", "id": "446"}, {"metadata": {"id": "Mamba for Vision.pdf:9:9"}, "page_content": "Vềtổng quát,\nSwin-UMamba vượt trội hoàn toàn so với các model CNN, Transformer, và các model Mamba trước đó.", "id": "447"}, {"metadata": {"id": "Mamba for Vision.pdf:9:10"}, "page_content": "9\n", "id": "448"}, {"metadata": {"id": "Mamba for Vision.pdf:10:0"}, "page_content": "AI VIETNAM\naivietnam.edu.vn\nHình 12: Bảng so sánh kết quảSwin-UMamba và các model khác.", "id": "449"}, {"metadata": {"id": "Mamba for Vision.pdf:10:1"}, "page_content": "7\nConclusion\nNhư vậy, trong bài viết này ta đã tìm hiểu vềkiến trúc Mamba được áp dụng cho data dạng ảnh thông\nqua nhiều bài toán khác nhau.", "id": "450"}, {"metadata": {"id": "Mamba for Vision.pdf:10:2"}, "page_content": "Ta thấy rằng, các model Mamba-based này hoàn toàn vượt trội so với\nTransformer vềcả3 tiêu chí: tốc độ, tài nguyên tiết kiệm, và độchính xác cao.", "id": "451"}, {"metadata": {"id": "Mamba for Vision.pdf:10:3"}, "page_content": "Các tiêu chí này đã\nđúng đối với data dạng text và dạng ảnh, vốn là 2 loại data phổbiến nhất.", "id": "452"}, {"metadata": {"id": "Mamba for Vision.pdf:10:4"}, "page_content": "Từđó, ta có thểmường\ntượng được rằng Mamba cũng sẽtốt ởhầu hết các loại data còn lại.", "id": "453"}, {"metadata": {"id": "Mamba for Vision.pdf:10:5"}, "page_content": "References\n[1] Gu, Albert, and Tri Dao.", "id": "454"}, {"metadata": {"id": "Mamba for Vision.pdf:10:6"}, "page_content": "“Mamba: Linear-time sequence modeling with selective state spaces.” arXiv\npreprint arXiv:2312.00752 (2023)\n[2] Zhu, Lianghui, et al. “Vision mamba: Efficient visual representation learning with bidirectional state\nspace model.” arXiv preprint arXiv:2401.09417 (2024).", "id": "455"}, {"metadata": {"id": "Mamba for Vision.pdf:10:7"}, "page_content": "[3] Liu, Yue, et al.", "id": "456"}, {"metadata": {"id": "Mamba for Vision.pdf:10:8"}, "page_content": "“Vmamba: Visual state space model.” arXiv preprint arXiv:2401.10166 (2024).", "id": "457"}, {"metadata": {"id": "Mamba for Vision.pdf:10:9"}, "page_content": "[4] Ma, Jun, Feifei Li, and Bo Wang.", "id": "458"}, {"metadata": {"id": "Mamba for Vision.pdf:10:10"}, "page_content": "“U-mamba: Enhancing long-range dependency for biomedical\nimage segmentation.” arXiv preprint arXiv:2401.04722 (2024).", "id": "459"}, {"metadata": {"id": "Mamba for Vision.pdf:10:11"}, "page_content": "[5] Liu, Jiarun, et al.", "id": "460"}, {"metadata": {"id": "Mamba for Vision.pdf:10:12"}, "page_content": "“Swin-UMamba: Mamba-based UNet with ImageNet-based pretraining.” arXiv\npreprint arXiv:2402.03302 (2024).", "id": "461"}, {"metadata": {"id": "Mamba for Vision.pdf:10:13"}, "page_content": "10\n", "id": "462"}], "ids": ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48", "49", "50", "51", "52", "53", "54", "55", "56", "57", "58", "59", "60", "61", "62", "63", "64", "65", "66", "67", "68", "69", "70", "71", "72", "73", "74", "75", "76", "77", "78", "79", "80", "81", "82", "83", "84", "85", "86", "87", "88", "89", "90", "91", "92", "93", "94", "95", "96", "97", "98", "99", "100", "101", "102", "103", "104", "105", "106", "107", "108", "109", "110", "111", "112", "113", "114", "115", "116", "117", "118", "119", "120", "121", "122", "123", "124", "125", "126", "127", "128", "129", "130", "131", "132", "133", "134", "135", "136", "137", "138", "139", "140", "141", "142", "143", "144", "145", "146", "147", "148", "149", "150", "151", "152", "153", "154", "155", "156", "157", "158", "159", "160", "161", "162", "163", "164", "165", "166", "167", "168", "169", "170", "171", "172", "173", "174", "175", "176", "177", "178", "179", "180", "181", "182", "183", "184", "185", "186", "187", "188", "189", "190", "191", "192", "193", "194", "195", "196", "197", "198", "199", "200", "201", "202", "203", "204", "205", "206", "207", "208", "209", "210", "211", "212", "213", "214", "215", "216", "217", "218", "219", "220", "221", "222", "223", "224", "225", "226", "227", "228", "229", "230", "231", "232", "233", "234", "235", "236", "237", "238", "239", "240", "241", "242", "243", "244", "245", "246", "247", "248", "249", "250", "251", "252", "253", "254", "255", "256", "257", "258", "259", "260", "261", "262", "263", "264", "265", "266", "267", "268", "269", "270", "271", "272", "273", "274", "275", "276", "277", "278", "279", "280", "281", "282", "283", "284", "285", "286", "287", "288", "289", "290", "291", "292", "293", "294", "295", "296", "297", "298", "299", "300", "301", "302", "303", "304", "305", "306", "307", "308", "309", "310", "311", "312", "313", "314", "315", "316", "317", "318", "319", "320", "321", "322", "323", "324", "325", "326", "327", "328", "329", "330", "331", "332", "333", "334", "335", "336", "337", "338", "339", "340", "341", "342", "343", "344", "345", "346", "347", "348", "349", "350", "351", "352", "353", "354", "355", "356", "357", "358", "359", "360", "361", "362", "363", "364", "365", "366", "367", "368", "369", "370", "371", "372", "373", "374", "375", "376", "377", "378", "379", "380", "381", "382", "383", "384", "385", "386", "387", "388", "389", "390", "391", "392", "393", "394", "395", "396", "397", "398", "399", "400", "401", "402", "403", "404", "405", "406", "407", "408", "409", "410", "411", "412", "413", "414", "415", "416", "417", "418", "419", "420", "421", "422", "423", "424", "425", "426", "427", "428", "429", "430", "431", "432", "433", "434", "435", "436", "437", "438", "439", "440", "441", "442", "443", "444", "445", "446", "447", "448", "449", "450", "451", "452", "453", "454", "455", "456", "457", "458", "459", "460", "461", "462"], "sources": [{"file_name": "RAG.pdf", "created_at": "2025-01-02 08:18:26"}, {"file_name": "Mamba for Vision.pdf", "created_at": "2025-01-02 08:18:27"}]}